Embeetle/sa/test/pic32/include/p32mz1024efg144reg.h
// #-------------------------------------------------------------------------
// # MPLAB XC Compiler -  PIC32MZ1024EFG144 processor definition module
// # 
// # Copyright (c 2020, Microchip Technology Inc. and its subsidiaries ("Microchip"
// # All rights reserved.
// # 
// # This software is developed by Microchip Technology Inc. and its
// # subsidiaries ("Microchip".
// # 
// # Redistribution and use in source and binary forms, with or without
// # modification, are permitted provided that the following conditions are 
// # met:
// # 
// # 1.      Redistributions of source code must retain the above copyright
// #         notice, this list of conditions and the following disclaimer.
// # 2.      Redistributions in binary form must reproduce the above 
// #         copyright notice, this list of conditions and the following 
// #         disclaimer in the documentation and/or other materials provided 
// #         with the distribution. Publication is not required when this file 
// #         is used in an embedded application.
// # 3.      Microchip's name may not be used to endorse or promote products
// #         derived from this software without specific prior written 
// #         permission.
// # 
// # THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED
// # WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
// # MERCHANTABILITY AND FITNESS FOR PURPOSE ARE DISCLAIMED. IN NO EVENT 
// # SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
// # EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
// # PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS;
// # OR BUSINESS INTERRUPTION HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY,
// # WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR 
// # OTHERWISE ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
// # ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// # 
// #
//
// #-------------------------------------------------------------------------

#define PIC32MZ_DEBUG 1
#define PIC32MZ_ENABLE_RTCC 1
#if defined (__has_c_attribute) || defined (__has_cpp_attribute)
extern void *_ebase_address;
#define EBASE_ADDR ((int)&_ebase_address)
#else
#define EBASE_ADDR _ebase_address
#endif
#define CFGCON  0xBF800000
#define DEVID  0xBF800020
#define SYSKEY  0xBF800030
#define PMD1  0xBF800040
#define PMD1CLR  0xBF800044
#define PMD1SET  0xBF800048
#define PMD1INV  0xBF80004C
#define PMD2  0xBF800050
#define PMD2CLR  0xBF800054
#define PMD2SET  0xBF800058
#define PMD2INV  0xBF80005C
#define PMD3  0xBF800060
#define PMD3CLR  0xBF800064
#define PMD3SET  0xBF800068
#define PMD3INV  0xBF80006C
#define PMD4  0xBF800070
#define PMD4CLR  0xBF800074
#define PMD4SET  0xBF800078
#define PMD4INV  0xBF80007C
#define PMD5  0xBF800080
#define PMD5CLR  0xBF800084
#define PMD5SET  0xBF800088
#define PMD5INV  0xBF80008C
#define PMD6  0xBF800090
#define PMD6CLR  0xBF800094
#define PMD6SET  0xBF800098
#define PMD6INV  0xBF80009C
#define PMD7  0xBF8000A0
#define PMD7CLR  0xBF8000A4
#define PMD7SET  0xBF8000A8
#define PMD7INV  0xBF8000AC
#define CFGEBIA  0xBF8000C0
#define CFGEBIACLR  0xBF8000C4
#define CFGEBIASET  0xBF8000C8
#define CFGEBIAINV  0xBF8000CC
#define CFGEBIC  0xBF8000D0
#define CFGEBICCLR  0xBF8000D4
#define CFGEBICSET  0xBF8000D8
#define CFGEBICINV  0xBF8000DC
#define CFGPG  0xBF8000E0
#define NVMCON  0xBF800600
#define NVMCONCLR  0xBF800604
#define NVMCONSET  0xBF800608
#define NVMCONINV  0xBF80060C
#define NVMKEY  0xBF800610
#define NVMADDR  0xBF800620
#define NVMADDRCLR  0xBF800624
#define NVMADDRSET  0xBF800628
#define NVMADDRINV  0xBF80062C
#define NVMDATA0  0xBF800630
#define NVMDATA0CLR  0xBF800634
#define NVMDATA0SET  0xBF800638
#define NVMDATA0INV  0xBF80063C
#define NVMDATA1  0xBF800640
#define NVMDATA1CLR  0xBF800644
#define NVMDATA1SET  0xBF800648
#define NVMDATA1INV  0xBF80064C
#define NVMDATA2  0xBF800650
#define NVMDATA2CLR  0xBF800654
#define NVMDATA2SET  0xBF800658
#define NVMDATA2INV  0xBF80065C
#define NVMDATA3  0xBF800660
#define NVMDATA3CLR  0xBF800664
#define NVMDATA3SET  0xBF800668
#define NVMDATA3INV  0xBF80066C
#define NVMSRCADDR  0xBF800670
#define NVMSRCADDRCLR  0xBF800674
#define NVMSRCADDRSET  0xBF800678
#define NVMSRCADDRINV  0xBF80067C
#define NVMPWP  0xBF800680
#define NVMPWPCLR  0xBF800684
#define NVMPWPSET  0xBF800688
#define NVMPWPINV  0xBF80068C
#define NVMBWP  0xBF800690
#define NVMBWPCLR  0xBF800694
#define NVMBWPSET  0xBF800698
#define NVMBWPINV  0xBF80069C
#define NVMCON2  0xBF8006A0
#define NVMCON2CLR  0xBF8006A4
#define NVMCON2SET  0xBF8006A8
#define NVMCON2INV  0xBF8006AC
#define WDTCON  0xBF800800
#define WDTCONCLR  0xBF800804
#define WDTCONSET  0xBF800808
#define WDTCONINV  0xBF80080C
#define DMTCON  0xBF800A00
#define DMTPRECLR  0xBF800A10
#define DMTCLR  0xBF800A20
#define DMTSTAT  0xBF800A30
#define DMTCNT  0xBF800A40
#define DMTPSCNT  0xBF800A60
#define DMTPSINTV  0xBF800A70
#define RTCCON  0xBF800C00
#define RTCCONCLR  0xBF800C04
#define RTCCONSET  0xBF800C08
#define RTCCONINV  0xBF800C0C
#define RTCALRM  0xBF800C10
#define RTCALRMCLR  0xBF800C14
#define RTCALRMSET  0xBF800C18
#define RTCALRMINV  0xBF800C1C
#define RTCTIME  0xBF800C20
#define RTCTIMECLR  0xBF800C24
#define RTCTIMESET  0xBF800C28
#define RTCTIMEINV  0xBF800C2C
#define RTCDATE  0xBF800C30
#define RTCDATECLR  0xBF800C34
#define RTCDATESET  0xBF800C38
#define RTCDATEINV  0xBF800C3C
#define ALRMTIME  0xBF800C40
#define ALRMTIMECLR  0xBF800C44
#define ALRMTIMESET  0xBF800C48
#define ALRMTIMEINV  0xBF800C4C
#define ALRMDATE  0xBF800C50
#define ALRMDATECLR  0xBF800C54
#define ALRMDATESET  0xBF800C58
#define ALRMDATEINV  0xBF800C5C
#define CVRCON  0xBF800E00
#define CVRCONCLR  0xBF800E04
#define CVRCONSET  0xBF800E08
#define CVRCONINV  0xBF800E0C
#define _ICDCON  0xBF801130
#define _ICDSTAT  0xBF801140
#define OSCCON  0xBF801200
#define OSCCONCLR  0xBF801204
#define OSCCONSET  0xBF801208
#define OSCCONINV  0xBF80120C
#define OSCTUN  0xBF801210
#define OSCTUNCLR  0xBF801214
#define OSCTUNSET  0xBF801218
#define OSCTUNINV  0xBF80121C
#define SPLLCON  0xBF801220
#define SPLLCONCLR  0xBF801224
#define SPLLCONSET  0xBF801228
#define SPLLCONINV  0xBF80122C
#define RCON  0xBF801240
#define RCONCLR  0xBF801244
#define RCONSET  0xBF801248
#define RCONINV  0xBF80124C
#define RSWRST  0xBF801250
#define RSWRSTCLR  0xBF801254
#define RSWRSTSET  0xBF801258
#define RSWRSTINV  0xBF80125C
#define RNMICON  0xBF801260
#define RNMICONCLR  0xBF801264
#define RNMICONSET  0xBF801268
#define RNMICONINV  0xBF80126C
#define PWRCON  0xBF801270
#define PWRCONCLR  0xBF801274
#define PWRCONSET  0xBF801278
#define PWRCONINV  0xBF80127C
#define REFO1CON  0xBF801280
#define REFO1CONCLR  0xBF801284
#define REFO1CONSET  0xBF801288
#define REFO1CONINV  0xBF80128C
#define REFO1TRIM  0xBF801290
#define REFO1TRIMCLR  0xBF801294
#define REFO1TRIMSET  0xBF801298
#define REFO1TRIMINV  0xBF80129C
#define REFO2CON  0xBF8012A0
#define REFO2CONCLR  0xBF8012A4
#define REFO2CONSET  0xBF8012A8
#define REFO2CONINV  0xBF8012AC
#define REFO2TRIM  0xBF8012B0
#define REFO2TRIMCLR  0xBF8012B4
#define REFO2TRIMSET  0xBF8012B8
#define REFO2TRIMINV  0xBF8012BC
#define REFO3CON  0xBF8012C0
#define REFO3CONCLR  0xBF8012C4
#define REFO3CONSET  0xBF8012C8
#define REFO3CONINV  0xBF8012CC
#define REFO3TRIM  0xBF8012D0
#define REFO3TRIMCLR  0xBF8012D4
#define REFO3TRIMSET  0xBF8012D8
#define REFO3TRIMINV  0xBF8012DC
#define REFO4CON  0xBF8012E0
#define REFO4CONCLR  0xBF8012E4
#define REFO4CONSET  0xBF8012E8
#define REFO4CONINV  0xBF8012EC
#define REFO4TRIM  0xBF8012F0
#define REFO4TRIMCLR  0xBF8012F4
#define REFO4TRIMSET  0xBF8012F8
#define REFO4TRIMINV  0xBF8012FC
#define PB1DIV  0xBF801300
#define PB1DIVCLR  0xBF801304
#define PB1DIVSET  0xBF801308
#define PB1DIVINV  0xBF80130C
#define PB2DIV  0xBF801310
#define PB2DIVCLR  0xBF801314
#define PB2DIVSET  0xBF801318
#define PB2DIVINV  0xBF80131C
#define PB3DIV  0xBF801320
#define PB3DIVCLR  0xBF801324
#define PB3DIVSET  0xBF801328
#define PB3DIVINV  0xBF80132C
#define PB4DIV  0xBF801330
#define PB4DIVCLR  0xBF801334
#define PB4DIVSET  0xBF801338
#define PB4DIVINV  0xBF80133C
#define PB5DIV  0xBF801340
#define PB5DIVCLR  0xBF801344
#define PB5DIVSET  0xBF801348
#define PB5DIVINV  0xBF80134C
#define PB7DIV  0xBF801360
#define PB7DIVCLR  0xBF801364
#define PB7DIVSET  0xBF801368
#define PB7DIVINV  0xBF80136C
#define PB8DIV  0xBF801370
#define PB8DIVCLR  0xBF801374
#define PB8DIVSET  0xBF801378
#define PB8DIVINV  0xBF80137C
#define SLEWCON  0xBF8013C0
#define SLEWCONCLR  0xBF8013C4
#define SLEWCONSET  0xBF8013C8
#define SLEWCONINV  0xBF8013CC
#define CLKSTAT  0xBF8013D0
#define CLKSTATCLR  0xBF8013D4
#define CLKSTATSET  0xBF8013D8
#define CLKSTATINV  0xBF8013DC
#define INT1R  0xBF801404
#define INT2R  0xBF801408
#define INT3R  0xBF80140C
#define INT4R  0xBF801410
#define T2CKR  0xBF801418
#define T3CKR  0xBF80141C
#define T4CKR  0xBF801420
#define T5CKR  0xBF801424
#define T6CKR  0xBF801428
#define T7CKR  0xBF80142C
#define T8CKR  0xBF801430
#define T9CKR  0xBF801434
#define IC1R  0xBF801438
#define IC2R  0xBF80143C
#define IC3R  0xBF801440
#define IC4R  0xBF801444
#define IC5R  0xBF801448
#define IC6R  0xBF80144C
#define IC7R  0xBF801450
#define IC8R  0xBF801454
#define IC9R  0xBF801458
#define OCFAR  0xBF801460
#define U1RXR  0xBF801468
#define U1CTSR  0xBF80146C
#define U2RXR  0xBF801470
#define U2CTSR  0xBF801474
#define U3RXR  0xBF801478
#define U3CTSR  0xBF80147C
#define U4RXR  0xBF801480
#define U4CTSR  0xBF801484
#define U5RXR  0xBF801488
#define U5CTSR  0xBF80148C
#define U6RXR  0xBF801490
#define U6CTSR  0xBF801494
#define SDI1R  0xBF80149C
#define SS1R  0xBF8014A0
#define SDI2R  0xBF8014A8
#define SS2R  0xBF8014AC
#define SDI3R  0xBF8014B4
#define SS3R  0xBF8014B8
#define SDI4R  0xBF8014C0
#define SS4R  0xBF8014C4
#define SDI5R  0xBF8014CC
#define SS5R  0xBF8014D0
#define SDI6R  0xBF8014D8
#define SS6R  0xBF8014DC
#define REFCLKI1R  0xBF8014E8
#define REFCLKI3R  0xBF8014F0
#define REFCLKI4R  0xBF8014F4
#define RPA14R  0xBF801538
#define RPA15R  0xBF80153C
#define RPB0R  0xBF801540
#define RPB1R  0xBF801544
#define RPB2R  0xBF801548
#define RPB3R  0xBF80154C
#define RPB5R  0xBF801554
#define RPB6R  0xBF801558
#define RPB7R  0xBF80155C
#define RPB8R  0xBF801560
#define RPB9R  0xBF801564
#define RPB10R  0xBF801568
#define RPB14R  0xBF801578
#define RPB15R  0xBF80157C
#define RPC1R  0xBF801584
#define RPC2R  0xBF801588
#define RPC3R  0xBF80158C
#define RPC4R  0xBF801590
#define RPC13R  0xBF8015B4
#define RPC14R  0xBF8015B8
#define RPD0R  0xBF8015C0
#define RPD1R  0xBF8015C4
#define RPD2R  0xBF8015C8
#define RPD3R  0xBF8015CC
#define RPD4R  0xBF8015D0
#define RPD5R  0xBF8015D4
#define RPD6R  0xBF8015D8
#define RPD7R  0xBF8015DC
#define RPD9R  0xBF8015E4
#define RPD10R  0xBF8015E8
#define RPD11R  0xBF8015EC
#define RPD12R  0xBF8015F0
#define RPD14R  0xBF8015F8
#define RPD15R  0xBF8015FC
#define RPE3R  0xBF80160C
#define RPE5R  0xBF801614
#define RPE8R  0xBF801620
#define RPE9R  0xBF801624
#define RPF0R  0xBF801640
#define RPF1R  0xBF801644
#define RPF2R  0xBF801648
#define RPF3R  0xBF80164C
#define RPF4R  0xBF801650
#define RPF5R  0xBF801654
#define RPF8R  0xBF801660
#define RPF12R  0xBF801670
#define RPF13R  0xBF801674
#define RPG0R  0xBF801680
#define RPG1R  0xBF801684
#define RPG6R  0xBF801698
#define RPG7R  0xBF80169C
#define RPG8R  0xBF8016A0
#define RPG9R  0xBF8016A4
#define INTCON  0xBF810000
#define INTCONCLR  0xBF810004
#define INTCONSET  0xBF810008
#define INTCONINV  0xBF81000C
#define PRISS  0xBF810010
#define PRISSCLR  0xBF810014
#define PRISSSET  0xBF810018
#define PRISSINV  0xBF81001C
#define INTSTAT  0xBF810020
#define INTSTATCLR  0xBF810024
#define INTSTATSET  0xBF810028
#define INTSTATINV  0xBF81002C
#define IPTMR  0xBF810030
#define IPTMRCLR  0xBF810034
#define IPTMRSET  0xBF810038
#define IPTMRINV  0xBF81003C
#define IFS0  0xBF810040
#define IFS0CLR  0xBF810044
#define IFS0SET  0xBF810048
#define IFS0INV  0xBF81004C
#define IFS1  0xBF810050
#define IFS1CLR  0xBF810054
#define IFS1SET  0xBF810058
#define IFS1INV  0xBF81005C
#define IFS2  0xBF810060
#define IFS2CLR  0xBF810064
#define IFS2SET  0xBF810068
#define IFS2INV  0xBF81006C
#define IFS3  0xBF810070
#define IFS3CLR  0xBF810074
#define IFS3SET  0xBF810078
#define IFS3INV  0xBF81007C
#define IFS4  0xBF810080
#define IFS4CLR  0xBF810084
#define IFS4SET  0xBF810088
#define IFS4INV  0xBF81008C
#define IFS5  0xBF810090
#define IFS5CLR  0xBF810094
#define IFS5SET  0xBF810098
#define IFS5INV  0xBF81009C
#define IFS6  0xBF8100A0
#define IFS6CLR  0xBF8100A4
#define IFS6SET  0xBF8100A8
#define IFS6INV  0xBF8100AC
#define IEC0  0xBF8100C0
#define IEC0CLR  0xBF8100C4
#define IEC0SET  0xBF8100C8
#define IEC0INV  0xBF8100CC
#define IEC1  0xBF8100D0
#define IEC1CLR  0xBF8100D4
#define IEC1SET  0xBF8100D8
#define IEC1INV  0xBF8100DC
#define IEC2  0xBF8100E0
#define IEC2CLR  0xBF8100E4
#define IEC2SET  0xBF8100E8
#define IEC2INV  0xBF8100EC
#define IEC3  0xBF8100F0
#define IEC3CLR  0xBF8100F4
#define IEC3SET  0xBF8100F8
#define IEC3INV  0xBF8100FC
#define IEC4  0xBF810100
#define IEC4CLR  0xBF810104
#define IEC4SET  0xBF810108
#define IEC4INV  0xBF81010C
#define IEC5  0xBF810110
#define IEC5CLR  0xBF810114
#define IEC5SET  0xBF810118
#define IEC5INV  0xBF81011C
#define IEC6  0xBF810120
#define IEC6CLR  0xBF810124
#define IEC6SET  0xBF810128
#define IEC6INV  0xBF81012C
#define IPC0  0xBF810140
#define IPC0CLR  0xBF810144
#define IPC0SET  0xBF810148
#define IPC0INV  0xBF81014C
#define IPC1  0xBF810150
#define IPC1CLR  0xBF810154
#define IPC1SET  0xBF810158
#define IPC1INV  0xBF81015C
#define IPC2  0xBF810160
#define IPC2CLR  0xBF810164
#define IPC2SET  0xBF810168
#define IPC2INV  0xBF81016C
#define IPC3  0xBF810170
#define IPC3CLR  0xBF810174
#define IPC3SET  0xBF810178
#define IPC3INV  0xBF81017C
#define IPC4  0xBF810180
#define IPC4CLR  0xBF810184
#define IPC4SET  0xBF810188
#define IPC4INV  0xBF81018C
#define IPC5  0xBF810190
#define IPC5CLR  0xBF810194
#define IPC5SET  0xBF810198
#define IPC5INV  0xBF81019C
#define IPC6  0xBF8101A0
#define IPC6CLR  0xBF8101A4
#define IPC6SET  0xBF8101A8
#define IPC6INV  0xBF8101AC
#define IPC7  0xBF8101B0
#define IPC7CLR  0xBF8101B4
#define IPC7SET  0xBF8101B8
#define IPC7INV  0xBF8101BC
#define IPC8  0xBF8101C0
#define IPC8CLR  0xBF8101C4
#define IPC8SET  0xBF8101C8
#define IPC8INV  0xBF8101CC
#define IPC9  0xBF8101D0
#define IPC9CLR  0xBF8101D4
#define IPC9SET  0xBF8101D8
#define IPC9INV  0xBF8101DC
#define IPC10  0xBF8101E0
#define IPC10CLR  0xBF8101E4
#define IPC10SET  0xBF8101E8
#define IPC10INV  0xBF8101EC
#define IPC11  0xBF8101F0
#define IPC11CLR  0xBF8101F4
#define IPC11SET  0xBF8101F8
#define IPC11INV  0xBF8101FC
#define IPC12  0xBF810200
#define IPC12CLR  0xBF810204
#define IPC12SET  0xBF810208
#define IPC12INV  0xBF81020C
#define IPC13  0xBF810210
#define IPC13CLR  0xBF810214
#define IPC13SET  0xBF810218
#define IPC13INV  0xBF81021C
#define IPC14  0xBF810220
#define IPC14CLR  0xBF810224
#define IPC14SET  0xBF810228
#define IPC14INV  0xBF81022C
#define IPC15  0xBF810230
#define IPC15CLR  0xBF810234
#define IPC15SET  0xBF810238
#define IPC15INV  0xBF81023C
#define IPC16  0xBF810240
#define IPC16CLR  0xBF810244
#define IPC16SET  0xBF810248
#define IPC16INV  0xBF81024C
#define IPC17  0xBF810250
#define IPC17CLR  0xBF810254
#define IPC17SET  0xBF810258
#define IPC17INV  0xBF81025C
#define IPC18  0xBF810260
#define IPC18CLR  0xBF810264
#define IPC18SET  0xBF810268
#define IPC18INV  0xBF81026C
#define IPC19  0xBF810270
#define IPC19CLR  0xBF810274
#define IPC19SET  0xBF810278
#define IPC19INV  0xBF81027C
#define IPC20  0xBF810280
#define IPC20CLR  0xBF810284
#define IPC20SET  0xBF810288
#define IPC20INV  0xBF81028C
#define IPC21  0xBF810290
#define IPC21CLR  0xBF810294
#define IPC21SET  0xBF810298
#define IPC21INV  0xBF81029C
#define IPC22  0xBF8102A0
#define IPC22CLR  0xBF8102A4
#define IPC22SET  0xBF8102A8
#define IPC22INV  0xBF8102AC
#define IPC23  0xBF8102B0
#define IPC23CLR  0xBF8102B4
#define IPC23SET  0xBF8102B8
#define IPC23INV  0xBF8102BC
#define IPC24  0xBF8102C0
#define IPC24CLR  0xBF8102C4
#define IPC24SET  0xBF8102C8
#define IPC24INV  0xBF8102CC
#define IPC25  0xBF8102D0
#define IPC25CLR  0xBF8102D4
#define IPC25SET  0xBF8102D8
#define IPC25INV  0xBF8102DC
#define IPC26  0xBF8102E0
#define IPC26CLR  0xBF8102E4
#define IPC26SET  0xBF8102E8
#define IPC26INV  0xBF8102EC
#define IPC27  0xBF8102F0
#define IPC27CLR  0xBF8102F4
#define IPC27SET  0xBF8102F8
#define IPC27INV  0xBF8102FC
#define IPC28  0xBF810300
#define IPC28CLR  0xBF810304
#define IPC28SET  0xBF810308
#define IPC28INV  0xBF81030C
#define IPC29  0xBF810310
#define IPC29CLR  0xBF810314
#define IPC29SET  0xBF810318
#define IPC29INV  0xBF81031C
#define IPC30  0xBF810320
#define IPC30CLR  0xBF810324
#define IPC30SET  0xBF810328
#define IPC30INV  0xBF81032C
#define IPC31  0xBF810330
#define IPC31CLR  0xBF810334
#define IPC31SET  0xBF810338
#define IPC31INV  0xBF81033C
#define IPC32  0xBF810340
#define IPC32CLR  0xBF810344
#define IPC32SET  0xBF810348
#define IPC32INV  0xBF81034C
#define IPC33  0xBF810350
#define IPC33CLR  0xBF810354
#define IPC33SET  0xBF810358
#define IPC33INV  0xBF81035C
#define IPC34  0xBF810360
#define IPC34CLR  0xBF810364
#define IPC34SET  0xBF810368
#define IPC34INV  0xBF81036C
#define IPC35  0xBF810370
#define IPC35CLR  0xBF810374
#define IPC35SET  0xBF810378
#define IPC35INV  0xBF81037C
#define IPC36  0xBF810380
#define IPC36CLR  0xBF810384
#define IPC36SET  0xBF810388
#define IPC36INV  0xBF81038C
#define IPC37  0xBF810390
#define IPC37CLR  0xBF810394
#define IPC37SET  0xBF810398
#define IPC37INV  0xBF81039C
#define IPC38  0xBF8103A0
#define IPC38CLR  0xBF8103A4
#define IPC38SET  0xBF8103A8
#define IPC38INV  0xBF8103AC
#define IPC39  0xBF8103B0
#define IPC39CLR  0xBF8103B4
#define IPC39SET  0xBF8103B8
#define IPC39INV  0xBF8103BC
#define IPC40  0xBF8103C0
#define IPC40CLR  0xBF8103C4
#define IPC40SET  0xBF8103C8
#define IPC40INV  0xBF8103CC
#define IPC41  0xBF8103D0
#define IPC41CLR  0xBF8103D4
#define IPC41SET  0xBF8103D8
#define IPC41INV  0xBF8103DC
#define IPC42  0xBF8103E0
#define IPC42CLR  0xBF8103E4
#define IPC42SET  0xBF8103E8
#define IPC42INV  0xBF8103EC
#define IPC43  0xBF8103F0
#define IPC43CLR  0xBF8103F4
#define IPC43SET  0xBF8103F8
#define IPC43INV  0xBF8103FC
#define IPC44  0xBF810400
#define IPC44CLR  0xBF810404
#define IPC44SET  0xBF810408
#define IPC44INV  0xBF81040C
#define IPC45  0xBF810410
#define IPC45CLR  0xBF810414
#define IPC45SET  0xBF810418
#define IPC45INV  0xBF81041C
#define IPC46  0xBF810420
#define IPC46CLR  0xBF810424
#define IPC46SET  0xBF810428
#define IPC46INV  0xBF81042C
#define IPC47  0xBF810430
#define IPC47CLR  0xBF810434
#define IPC47SET  0xBF810438
#define IPC47INV  0xBF81043C
#define IPC48  0xBF810440
#define IPC48CLR  0xBF810444
#define IPC48SET  0xBF810448
#define IPC48INV  0xBF81044C
#define IPC49  0xBF810450
#define IPC49CLR  0xBF810454
#define IPC49SET  0xBF810458
#define IPC49INV  0xBF81045C
#define IPC50  0xBF810460
#define IPC50CLR  0xBF810464
#define IPC50SET  0xBF810468
#define IPC50INV  0xBF81046C
#define IPC51  0xBF810470
#define IPC51CLR  0xBF810474
#define IPC51SET  0xBF810478
#define IPC51INV  0xBF81047C
#define IPC52  0xBF810480
#define IPC52CLR  0xBF810484
#define IPC52SET  0xBF810488
#define IPC52INV  0xBF81048C
#define IPC53  0xBF810490
#define IPC53CLR  0xBF810494
#define IPC53SET  0xBF810498
#define IPC53INV  0xBF81049C
#define OFF000  0xBF810540
#define OFF001  0xBF810544
#define OFF002  0xBF810548
#define OFF003  0xBF81054C
#define OFF004  0xBF810550
#define OFF005  0xBF810554
#define OFF006  0xBF810558
#define OFF007  0xBF81055C
#define OFF008  0xBF810560
#define OFF009  0xBF810564
#define OFF010  0xBF810568
#define OFF011  0xBF81056C
#define OFF012  0xBF810570
#define OFF013  0xBF810574
#define OFF014  0xBF810578
#define OFF015  0xBF81057C
#define OFF016  0xBF810580
#define OFF017  0xBF810584
#define OFF018  0xBF810588
#define OFF019  0xBF81058C
#define OFF020  0xBF810590
#define OFF021  0xBF810594
#define OFF022  0xBF810598
#define OFF023  0xBF81059C
#define OFF024  0xBF8105A0
#define OFF025  0xBF8105A4
#define OFF026  0xBF8105A8
#define OFF027  0xBF8105AC
#define OFF028  0xBF8105B0
#define OFF029  0xBF8105B4
#define OFF030  0xBF8105B8
#define OFF031  0xBF8105BC
#define OFF032  0xBF8105C0
#define OFF033  0xBF8105C4
#define OFF034  0xBF8105C8
#define OFF035  0xBF8105CC
#define OFF036  0xBF8105D0
#define OFF037  0xBF8105D4
#define OFF038  0xBF8105D8
#define OFF039  0xBF8105DC
#define OFF040  0xBF8105E0
#define OFF041  0xBF8105E4
#define OFF042  0xBF8105E8
#define OFF043  0xBF8105EC
#define OFF044  0xBF8105F0
#define OFF045  0xBF8105F4
#define OFF046  0xBF8105F8
#define OFF047  0xBF8105FC
#define OFF048  0xBF810600
#define OFF049  0xBF810604
#define OFF050  0xBF810608
#define OFF051  0xBF81060C
#define OFF052  0xBF810610
#define OFF053  0xBF810614
#define OFF054  0xBF810618
#define OFF055  0xBF81061C
#define OFF056  0xBF810620
#define OFF057  0xBF810624
#define OFF058  0xBF810628
#define OFF059  0xBF81062C
#define OFF060  0xBF810630
#define OFF061  0xBF810634
#define OFF062  0xBF810638
#define OFF063  0xBF81063C
#define OFF064  0xBF810640
#define OFF065  0xBF810644
#define OFF066  0xBF810648
#define OFF067  0xBF81064C
#define OFF068  0xBF810650
#define OFF069  0xBF810654
#define OFF070  0xBF810658
#define OFF071  0xBF81065C
#define OFF072  0xBF810660
#define OFF073  0xBF810664
#define OFF074  0xBF810668
#define OFF075  0xBF81066C
#define OFF076  0xBF810670
#define OFF077  0xBF810674
#define OFF078  0xBF810678
#define OFF079  0xBF81067C
#define OFF080  0xBF810680
#define OFF081  0xBF810684
#define OFF082  0xBF810688
#define OFF083  0xBF81068C
#define OFF084  0xBF810690
#define OFF085  0xBF810694
#define OFF086  0xBF810698
#define OFF087  0xBF81069C
#define OFF088  0xBF8106A0
#define OFF089  0xBF8106A4
#define OFF090  0xBF8106A8
#define OFF091  0xBF8106AC
#define OFF092  0xBF8106B0
#define OFF093  0xBF8106B4
#define OFF094  0xBF8106B8
#define OFF095  0xBF8106BC
#define OFF096  0xBF8106C0
#define OFF097  0xBF8106C4
#define OFF098  0xBF8106C8
#define OFF099  0xBF8106CC
#define OFF100  0xBF8106D0
#define OFF101  0xBF8106D4
#define OFF102  0xBF8106D8
#define OFF103  0xBF8106DC
#define OFF104  0xBF8106E0
#define OFF105  0xBF8106E4
#define OFF106  0xBF8106E8
#define OFF109  0xBF8106F4
#define OFF110  0xBF8106F8
#define OFF111  0xBF8106FC
#define OFF112  0xBF810700
#define OFF113  0xBF810704
#define OFF114  0xBF810708
#define OFF115  0xBF81070C
#define OFF116  0xBF810710
#define OFF117  0xBF810714
#define OFF118  0xBF810718
#define OFF119  0xBF81071C
#define OFF120  0xBF810720
#define OFF121  0xBF810724
#define OFF122  0xBF810728
#define OFF123  0xBF81072C
#define OFF124  0xBF810730
#define OFF125  0xBF810734
#define OFF126  0xBF810738
#define OFF127  0xBF81073C
#define OFF128  0xBF810740
#define OFF129  0xBF810744
#define OFF130  0xBF810748
#define OFF131  0xBF81074C
#define OFF132  0xBF810750
#define OFF133  0xBF810754
#define OFF134  0xBF810758
#define OFF135  0xBF81075C
#define OFF136  0xBF810760
#define OFF137  0xBF810764
#define OFF138  0xBF810768
#define OFF139  0xBF81076C
#define OFF140  0xBF810770
#define OFF141  0xBF810774
#define OFF142  0xBF810778
#define OFF143  0xBF81077C
#define OFF144  0xBF810780
#define OFF145  0xBF810784
#define OFF146  0xBF810788
#define OFF147  0xBF81078C
#define OFF148  0xBF810790
#define OFF149  0xBF810794
#define OFF150  0xBF810798
#define OFF153  0xBF8107A4
#define OFF154  0xBF8107A8
#define OFF155  0xBF8107AC
#define OFF156  0xBF8107B0
#define OFF157  0xBF8107B4
#define OFF158  0xBF8107B8
#define OFF159  0xBF8107BC
#define OFF160  0xBF8107C0
#define OFF161  0xBF8107C4
#define OFF162  0xBF8107C8
#define OFF163  0xBF8107CC
#define OFF164  0xBF8107D0
#define OFF165  0xBF8107D4
#define OFF166  0xBF8107D8
#define OFF167  0xBF8107DC
#define OFF168  0xBF8107E0
#define OFF169  0xBF8107E4
