Embeetle/sa/test/pic32/include/p32mz1024efg144reg.h
#define OFF170  0xBF8107E8
#define OFF171  0xBF8107EC
#define OFF172  0xBF8107F0
#define OFF173  0xBF8107F4
#define OFF174  0xBF8107F8
#define OFF175  0xBF8107FC
#define OFF176  0xBF810800
#define OFF177  0xBF810804
#define OFF178  0xBF810808
#define OFF179  0xBF81080C
#define OFF180  0xBF810810
#define OFF181  0xBF810814
#define OFF182  0xBF810818
#define OFF183  0xBF81081C
#define OFF184  0xBF810820
#define OFF185  0xBF810824
#define OFF186  0xBF810828
#define OFF187  0xBF81082C
#define OFF188  0xBF810830
#define OFF189  0xBF810834
#define OFF190  0xBF810838
#define OFF192  0xBF810840
#define OFF193  0xBF810844
#define OFF194  0xBF810848
#define OFF196  0xBF810850
#define OFF198  0xBF810858
#define OFF199  0xBF81085C
#define OFF200  0xBF810860
#define OFF201  0xBF810864
#define OFF202  0xBF810868
#define OFF205  0xBF810874
#define OFF206  0xBF810878
#define OFF207  0xBF81087C
#define OFF208  0xBF810880
#define OFF209  0xBF810884
#define OFF210  0xBF810888
#define OFF213  0xBF810894
#define DMACON  0xBF811000
#define DMACONCLR  0xBF811004
#define DMACONSET  0xBF811008
#define DMACONINV  0xBF81100C
#define DMASTAT  0xBF811010
#define DMASTATCLR  0xBF811014
#define DMASTATSET  0xBF811018
#define DMASTATINV  0xBF81101C
#define DMAADDR  0xBF811020
#define DMAADDRCLR  0xBF811024
#define DMAADDRSET  0xBF811028
#define DMAADDRINV  0xBF81102C
#define DCRCCON  0xBF811030
#define DCRCCONCLR  0xBF811034
#define DCRCCONSET  0xBF811038
#define DCRCCONINV  0xBF81103C
#define DCRCDATA  0xBF811040
#define DCRCDATACLR  0xBF811044
#define DCRCDATASET  0xBF811048
#define DCRCDATAINV  0xBF81104C
#define DCRCXOR  0xBF811050
#define DCRCXORCLR  0xBF811054
#define DCRCXORSET  0xBF811058
#define DCRCXORINV  0xBF81105C
#define DCH0CON  0xBF811060
#define DCH0CONCLR  0xBF811064
#define DCH0CONSET  0xBF811068
#define DCH0CONINV  0xBF81106C
#define DCH0ECON  0xBF811070
#define DCH0ECONCLR  0xBF811074
#define DCH0ECONSET  0xBF811078
#define DCH0ECONINV  0xBF81107C
#define DCH0INT  0xBF811080
#define DCH0INTCLR  0xBF811084
#define DCH0INTSET  0xBF811088
#define DCH0INTINV  0xBF81108C
#define DCH0SSA  0xBF811090
#define DCH0SSACLR  0xBF811094
#define DCH0SSASET  0xBF811098
#define DCH0SSAINV  0xBF81109C
#define DCH0DSA  0xBF8110A0
#define DCH0DSACLR  0xBF8110A4
#define DCH0DSASET  0xBF8110A8
#define DCH0DSAINV  0xBF8110AC
#define DCH0SSIZ  0xBF8110B0
#define DCH0SSIZCLR  0xBF8110B4
#define DCH0SSIZSET  0xBF8110B8
#define DCH0SSIZINV  0xBF8110BC
#define DCH0DSIZ  0xBF8110C0
#define DCH0DSIZCLR  0xBF8110C4
#define DCH0DSIZSET  0xBF8110C8
#define DCH0DSIZINV  0xBF8110CC
#define DCH0SPTR  0xBF8110D0
#define DCH0SPTRCLR  0xBF8110D4
#define DCH0SPTRSET  0xBF8110D8
#define DCH0SPTRINV  0xBF8110DC
#define DCH0DPTR  0xBF8110E0
#define DCH0DPTRCLR  0xBF8110E4
#define DCH0DPTRSET  0xBF8110E8
#define DCH0DPTRINV  0xBF8110EC
#define DCH0CSIZ  0xBF8110F0
#define DCH0CSIZCLR  0xBF8110F4
#define DCH0CSIZSET  0xBF8110F8
#define DCH0CSIZINV  0xBF8110FC
#define DCH0CPTR  0xBF811100
#define DCS0CPTR  0xBF811100
#define DCH0CPTRCLR  0xBF811104
#define DCS0CPTRCLR  0xBF811104
#define DCH0CPTRSET  0xBF811108
#define DCS0CPTRSET  0xBF811108
#define DCH0CPTRINV  0xBF81110C
#define DCS0CPTRINV  0xBF81110C
#define DCH0DAT  0xBF811110
#define DCH0DATCLR  0xBF811114
#define DCH0DATSET  0xBF811118
#define DCH0DATINV  0xBF81111C
#define DCH1CON  0xBF811120
#define DCH1CONCLR  0xBF811124
#define DCH1CONSET  0xBF811128
#define DCH1CONINV  0xBF81112C
#define DCH1ECON  0xBF811130
#define DCH1ECONCLR  0xBF811134
#define DCH1ECONSET  0xBF811138
#define DCH1ECONINV  0xBF81113C
#define DCH1INT  0xBF811140
#define DCH1INTCLR  0xBF811144
#define DCH1INTSET  0xBF811148
#define DCH1INTINV  0xBF81114C
#define DCH1SSA  0xBF811150
#define DCH1SSACLR  0xBF811154
#define DCH1SSASET  0xBF811158
#define DCH1SSAINV  0xBF81115C
#define DCH1DSA  0xBF811160
#define DCH1DSACLR  0xBF811164
#define DCH1DSASET  0xBF811168
#define DCH1DSAINV  0xBF81116C
#define DCH1SSIZ  0xBF811170
#define DCH1SSIZCLR  0xBF811174
#define DCH1SSIZSET  0xBF811178
#define DCH1SSIZINV  0xBF81117C
#define DCH1DSIZ  0xBF811180
#define DCH1DSIZCLR  0xBF811184
#define DCH1DSIZSET  0xBF811188
#define DCH1DSIZINV  0xBF81118C
#define DCH1SPTR  0xBF811190
#define DCH1SPTRCLR  0xBF811194
#define DCH1SPTRSET  0xBF811198
#define DCH1SPTRINV  0xBF81119C
#define DCH1DPTR  0xBF8111A0
#define DCH1DPTRCLR  0xBF8111A4
#define DCH1DPTRSET  0xBF8111A8
#define DCH1DPTRINV  0xBF8111AC
#define DCH1CSIZ  0xBF8111B0
#define DCH1CSIZCLR  0xBF8111B4
#define DCH1CSIZSET  0xBF8111B8
#define DCH1CSIZINV  0xBF8111BC
#define DCH1CPTR  0xBF8111C0
#define DCS1CPTR  0xBF8111C0
#define DCH1CPTRCLR  0xBF8111C4
#define DCS1CPTRCLR  0xBF8111C4
#define DCH1CPTRSET  0xBF8111C8
#define DCS1CPTRSET  0xBF8111C8
#define DCH1CPTRINV  0xBF8111CC
#define DCS1CPTRINV  0xBF8111CC
#define DCH1DAT  0xBF8111D0
#define DCH1DATCLR  0xBF8111D4
#define DCH1DATSET  0xBF8111D8
#define DCH1DATINV  0xBF8111DC
#define DCH2CON  0xBF8111E0
#define DCH2CONCLR  0xBF8111E4
#define DCH2CONSET  0xBF8111E8
#define DCH2CONINV  0xBF8111EC
#define DCH2ECON  0xBF8111F0
#define DCH2ECONCLR  0xBF8111F4
#define DCH2ECONSET  0xBF8111F8
#define DCH2ECONINV  0xBF8111FC
#define DCH2INT  0xBF811200
#define DCH2INTCLR  0xBF811204
#define DCH2INTSET  0xBF811208
#define DCH2INTINV  0xBF81120C
#define DCH2SSA  0xBF811210
#define DCH2SSACLR  0xBF811214
#define DCH2SSASET  0xBF811218
#define DCH2SSAINV  0xBF81121C
#define DCH2DSA  0xBF811220
#define DCH2DSACLR  0xBF811224
#define DCH2DSASET  0xBF811228
#define DCH2DSAINV  0xBF81122C
#define DCH2SSIZ  0xBF811230
#define DCH2SSIZCLR  0xBF811234
#define DCH2SSIZSET  0xBF811238
#define DCH2SSIZINV  0xBF81123C
#define DCH2DSIZ  0xBF811240
#define DCH2DSIZCLR  0xBF811244
#define DCH2DSIZSET  0xBF811248
#define DCH2DSIZINV  0xBF81124C
#define DCH2SPTR  0xBF811250
#define DCH2SPTRCLR  0xBF811254
#define DCH2SPTRSET  0xBF811258
#define DCH2SPTRINV  0xBF81125C
#define DCH2DPTR  0xBF811260
#define DCH2DPTRCLR  0xBF811264
#define DCH2DPTRSET  0xBF811268
#define DCH2DPTRINV  0xBF81126C
#define DCH2CSIZ  0xBF811270
#define DCH2CSIZCLR  0xBF811274
#define DCH2CSIZSET  0xBF811278
#define DCH2CSIZINV  0xBF81127C
#define DCH2CPTR  0xBF811280
#define DCS2CPTR  0xBF811280
#define DCH2CPTRCLR  0xBF811284
#define DCS2CPTRCLR  0xBF811284
#define DCH2CPTRSET  0xBF811288
#define DCS2CPTRSET  0xBF811288
#define DCH2CPTRINV  0xBF81128C
#define DCS2CPTRINV  0xBF81128C
#define DCH2DAT  0xBF811290
#define DCH2DATCLR  0xBF811294
#define DCH2DATSET  0xBF811298
#define DCH2DATINV  0xBF81129C
#define DCH3CON  0xBF8112A0
#define DCH3CONCLR  0xBF8112A4
#define DCH3CONSET  0xBF8112A8
#define DCH3CONINV  0xBF8112AC
#define DCH3ECON  0xBF8112B0
#define DCH3ECONCLR  0xBF8112B4
#define DCH3ECONSET  0xBF8112B8
#define DCH3ECONINV  0xBF8112BC
#define DCH3INT  0xBF8112C0
#define DCH3INTCLR  0xBF8112C4
#define DCH3INTSET  0xBF8112C8
#define DCH3INTINV  0xBF8112CC
#define DCH3SSA  0xBF8112D0
#define DCH3SSACLR  0xBF8112D4
#define DCH3SSASET  0xBF8112D8
#define DCH3SSAINV  0xBF8112DC
#define DCH3DSA  0xBF8112E0
#define DCH3DSACLR  0xBF8112E4
#define DCH3DSASET  0xBF8112E8
#define DCH3DSAINV  0xBF8112EC
#define DCH3SSIZ  0xBF8112F0
#define DCH3SSIZCLR  0xBF8112F4
#define DCH3SSIZSET  0xBF8112F8
#define DCH3SSIZINV  0xBF8112FC
#define DCH3DSIZ  0xBF811300
#define DCH3DSIZCLR  0xBF811304
#define DCH3DSIZSET  0xBF811308
#define DCH3DSIZINV  0xBF81130C
#define DCH3SPTR  0xBF811310
#define DCH3SPTRCLR  0xBF811314
#define DCH3SPTRSET  0xBF811318
#define DCH3SPTRINV  0xBF81131C
#define DCH3DPTR  0xBF811320
#define DCH3DPTRCLR  0xBF811324
#define DCH3DPTRSET  0xBF811328
#define DCH3DPTRINV  0xBF81132C
#define DCH3CSIZ  0xBF811330
#define DCH3CSIZCLR  0xBF811334
#define DCH3CSIZSET  0xBF811338
#define DCH3CSIZINV  0xBF81133C
#define DCH3CPTR  0xBF811340
#define DCS3CPTR  0xBF811340
#define DCH3CPTRCLR  0xBF811344
#define DCS3CPTRCLR  0xBF811344
#define DCH3CPTRSET  0xBF811348
#define DCS3CPTRSET  0xBF811348
#define DCH3CPTRINV  0xBF81134C
#define DCS3CPTRINV  0xBF81134C
#define DCH3DAT  0xBF811350
#define DCH3DATCLR  0xBF811354
#define DCH3DATSET  0xBF811358
#define DCH3DATINV  0xBF81135C
#define DCH4CON  0xBF811360
#define DCH4CONCLR  0xBF811364
#define DCH4CONSET  0xBF811368
#define DCH4CONINV  0xBF81136C
#define DCH4ECON  0xBF811370
#define DCH4ECONCLR  0xBF811374
#define DCH4ECONSET  0xBF811378
#define DCH4ECONINV  0xBF81137C
#define DCH4INT  0xBF811380
#define DCH4INTCLR  0xBF811384
#define DCH4INTSET  0xBF811388
#define DCH4INTINV  0xBF81138C
#define DCH4SSA  0xBF811390
#define DCH4SSACLR  0xBF811394
#define DCH4SSASET  0xBF811398
#define DCH4SSAINV  0xBF81139C
#define DCH4DSA  0xBF8113A0
#define DCH4DSACLR  0xBF8113A4
#define DCH4DSASET  0xBF8113A8
#define DCH4DSAINV  0xBF8113AC
#define DCH4SSIZ  0xBF8113B0
#define DCH4SSIZCLR  0xBF8113B4
#define DCH4SSIZSET  0xBF8113B8
#define DCH4SSIZINV  0xBF8113BC
#define DCH4DSIZ  0xBF8113C0
#define DCH4DSIZCLR  0xBF8113C4
#define DCH4DSIZSET  0xBF8113C8
#define DCH4DSIZINV  0xBF8113CC
#define DCH4SPTR  0xBF8113D0
#define DCH4SPTRCLR  0xBF8113D4
#define DCH4SPTRSET  0xBF8113D8
#define DCH4SPTRINV  0xBF8113DC
#define DCH4DPTR  0xBF8113E0
#define DCH4DPTRCLR  0xBF8113E4
#define DCH4DPTRSET  0xBF8113E8
#define DCH4DPTRINV  0xBF8113EC
#define DCH4CSIZ  0xBF8113F0
#define DCH4CSIZCLR  0xBF8113F4
#define DCH4CSIZSET  0xBF8113F8
#define DCH4CSIZINV  0xBF8113FC
#define DCH4CPTR  0xBF811400
#define DCS4CPTR  0xBF811400
#define DCH4CPTRCLR  0xBF811404
#define DCS4CPTRCLR  0xBF811404
#define DCH4CPTRSET  0xBF811408
#define DCS4CPTRSET  0xBF811408
#define DCH4CPTRINV  0xBF81140C
#define DCS4CPTRINV  0xBF81140C
#define DCH4DAT  0xBF811410
#define DCH4DATCLR  0xBF811414
#define DCH4DATSET  0xBF811418
#define DCH4DATINV  0xBF81141C
#define DCH5CON  0xBF811420
#define DCH5CONCLR  0xBF811424
#define DCH5CONSET  0xBF811428
#define DCH5CONINV  0xBF81142C
#define DCH5ECON  0xBF811430
#define DCH5ECONCLR  0xBF811434
#define DCH5ECONSET  0xBF811438
#define DCH5ECONINV  0xBF81143C
#define DCH5INT  0xBF811440
#define DCH5INTCLR  0xBF811444
#define DCH5INTSET  0xBF811448
#define DCH5INTINV  0xBF81144C
#define DCH5SSA  0xBF811450
#define DCH5SSACLR  0xBF811454
#define DCH5SSASET  0xBF811458
#define DCH5SSAINV  0xBF81145C
#define DCH5DSA  0xBF811460
#define DCH5DSACLR  0xBF811464
#define DCH5DSASET  0xBF811468
#define DCH5DSAINV  0xBF81146C
#define DCH5SSIZ  0xBF811470
#define DCH5SSIZCLR  0xBF811474
#define DCH5SSIZSET  0xBF811478
#define DCH5SSIZINV  0xBF81147C
#define DCH5DSIZ  0xBF811480
#define DCH5DSIZCLR  0xBF811484
#define DCH5DSIZSET  0xBF811488
#define DCH5DSIZINV  0xBF81148C
#define DCH5SPTR  0xBF811490
#define DCH5SPTRCLR  0xBF811494
#define DCH5SPTRSET  0xBF811498
#define DCH5SPTRINV  0xBF81149C
#define DCH5DPTR  0xBF8114A0
#define DCH5DPTRCLR  0xBF8114A4
#define DCH5DPTRSET  0xBF8114A8
#define DCH5DPTRINV  0xBF8114AC
#define DCH5CSIZ  0xBF8114B0
#define DCH5CSIZCLR  0xBF8114B4
#define DCH5CSIZSET  0xBF8114B8
#define DCH5CSIZINV  0xBF8114BC
#define DCH5CPTR  0xBF8114C0
#define DCS5CPTR  0xBF8114C0
#define DCH5CPTRCLR  0xBF8114C4
#define DCS5CPTRCLR  0xBF8114C4
#define DCH5CPTRSET  0xBF8114C8
#define DCS5CPTRSET  0xBF8114C8
#define DCH5CPTRINV  0xBF8114CC
#define DCS5CPTRINV  0xBF8114CC
#define DCH5DAT  0xBF8114D0
#define DCH5DATCLR  0xBF8114D4
#define DCH5DATSET  0xBF8114D8
#define DCH5DATINV  0xBF8114DC
#define DCH6CON  0xBF8114E0
#define DCH6CONCLR  0xBF8114E4
#define DCH6CONSET  0xBF8114E8
#define DCH6CONINV  0xBF8114EC
#define DCH6ECON  0xBF8114F0
#define DCH6ECONCLR  0xBF8114F4
#define DCH6ECONSET  0xBF8114F8
#define DCH6ECONINV  0xBF8114FC
#define DCH6INT  0xBF811500
#define DCH6INTCLR  0xBF811504
#define DCH6INTSET  0xBF811508
#define DCH6INTINV  0xBF81150C
#define DCH6SSA  0xBF811510
#define DCH6SSACLR  0xBF811514
#define DCH6SSASET  0xBF811518
#define DCH6SSAINV  0xBF81151C
#define DCH6DSA  0xBF811520
#define DCH6DSACLR  0xBF811524
#define DCH6DSASET  0xBF811528
#define DCH6DSAINV  0xBF81152C
#define DCH6SSIZ  0xBF811530
#define DCH6SSIZCLR  0xBF811534
#define DCH6SSIZSET  0xBF811538
#define DCH6SSIZINV  0xBF81153C
#define DCH6DSIZ  0xBF811540
#define DCH6DSIZCLR  0xBF811544
#define DCH6DSIZSET  0xBF811548
#define DCH6DSIZINV  0xBF81154C
#define DCH6SPTR  0xBF811550
#define DCH6SPTRCLR  0xBF811554
#define DCH6SPTRSET  0xBF811558
#define DCH6SPTRINV  0xBF81155C
#define DCH6DPTR  0xBF811560
#define DCH6DPTRCLR  0xBF811564
#define DCH6DPTRSET  0xBF811568
#define DCH6DPTRINV  0xBF81156C
#define DCH6CSIZ  0xBF811570
#define DCH6CSIZCLR  0xBF811574
#define DCH6CSIZSET  0xBF811578
#define DCH6CSIZINV  0xBF81157C
#define DCH6CPTR  0xBF811580
#define DCS6CPTR  0xBF811580
#define DCH6CPTRCLR  0xBF811584
#define DCS6CPTRCLR  0xBF811584
#define DCH6CPTRSET  0xBF811588
#define DCS6CPTRSET  0xBF811588
#define DCH6CPTRINV  0xBF81158C
#define DCS6CPTRINV  0xBF81158C
#define DCH6DAT  0xBF811590
#define DCH6DATCLR  0xBF811594
#define DCH6DATSET  0xBF811598
#define DCH6DATINV  0xBF81159C
#define DCH7CON  0xBF8115A0
#define DCH7CONCLR  0xBF8115A4
#define DCH7CONSET  0xBF8115A8
#define DCH7CONINV  0xBF8115AC
#define DCH7ECON  0xBF8115B0
#define DCH7ECONCLR  0xBF8115B4
#define DCH7ECONSET  0xBF8115B8
#define DCH7ECONINV  0xBF8115BC
#define DCH7INT  0xBF8115C0
#define DCH7INTCLR  0xBF8115C4
#define DCH7INTSET  0xBF8115C8
#define DCH7INTINV  0xBF8115CC
#define DCH7SSA  0xBF8115D0
#define DCH7SSACLR  0xBF8115D4
#define DCH7SSASET  0xBF8115D8
#define DCH7SSAINV  0xBF8115DC
#define DCH7DSA  0xBF8115E0
#define DCH7DSACLR  0xBF8115E4
#define DCH7DSASET  0xBF8115E8
#define DCH7DSAINV  0xBF8115EC
#define DCH7SSIZ  0xBF8115F0
#define DCH7SSIZCLR  0xBF8115F4
#define DCH7SSIZSET  0xBF8115F8
#define DCH7SSIZINV  0xBF8115FC
#define DCH7DSIZ  0xBF811600
#define DCH7DSIZCLR  0xBF811604
#define DCH7DSIZSET  0xBF811608
#define DCH7DSIZINV  0xBF81160C
#define DCH7SPTR  0xBF811610
#define DCH7SPTRCLR  0xBF811614
#define DCH7SPTRSET  0xBF811618
#define DCH7SPTRINV  0xBF81161C
#define DCH7DPTR  0xBF811620
#define DCH7DPTRCLR  0xBF811624
#define DCH7DPTRSET  0xBF811628
#define DCH7DPTRINV  0xBF81162C
#define DCH7CSIZ  0xBF811630
#define DCH7CSIZCLR  0xBF811634
#define DCH7CSIZSET  0xBF811638
#define DCH7CSIZINV  0xBF81163C
#define DCH7CPTR  0xBF811640
#define DCS7CPTR  0xBF811640
#define DCH7CPTRCLR  0xBF811644
#define DCS7CPTRCLR  0xBF811644
#define DCH7CPTRSET  0xBF811648
#define DCS7CPTRSET  0xBF811648
#define DCH7CPTRINV  0xBF81164C
#define DCS7CPTRINV  0xBF81164C
#define DCH7DAT  0xBF811650
#define DCH7DATCLR  0xBF811654
#define DCH7DATSET  0xBF811658
#define DCH7DATINV  0xBF81165C
#define I2C1CON  0xBF820000
#define I2C1CONCLR  0xBF820004
#define I2C1CONSET  0xBF820008
#define I2C1CONINV  0xBF82000C
#define I2C1STAT  0xBF820010
#define I2C1STATCLR  0xBF820014
#define I2C1STATSET  0xBF820018
#define I2C1STATINV  0xBF82001C
#define I2C1ADD  0xBF820020
#define I2C1ADDCLR  0xBF820024
#define I2C1ADDSET  0xBF820028
#define I2C1ADDINV  0xBF82002C
#define I2C1MSK  0xBF820030
#define I2C1MSKCLR  0xBF820034
#define I2C1MSKSET  0xBF820038
#define I2C1MSKINV  0xBF82003C
#define I2C1BRG  0xBF820040
#define I2C1BRGCLR  0xBF820044
#define I2C1BRGSET  0xBF820048
#define I2C1BRGINV  0xBF82004C
#define I2C1TRN  0xBF820050
#define I2C1TRNCLR  0xBF820054
#define I2C1TRNSET  0xBF820058
#define I2C1TRNINV  0xBF82005C
#define I2C1RCV  0xBF820060
#define I2C1RCVCLR  0xBF820064
#define I2C1RCVSET  0xBF820068
#define I2C1RCVINV  0xBF82006C
#define I2C2CON  0xBF820200
#define I2C2CONCLR  0xBF820204
#define I2C2CONSET  0xBF820208
#define I2C2CONINV  0xBF82020C
#define I2C2STAT  0xBF820210
#define I2C2STATCLR  0xBF820214
#define I2C2STATSET  0xBF820218
#define I2C2STATINV  0xBF82021C
#define I2C2ADD  0xBF820220
#define I2C2ADDCLR  0xBF820224
#define I2C2ADDSET  0xBF820228
#define I2C2ADDINV  0xBF82022C
#define I2C2MSK  0xBF820230
#define I2C2MSKCLR  0xBF820234
#define I2C2MSKSET  0xBF820238
#define I2C2MSKINV  0xBF82023C
#define I2C2BRG  0xBF820240
#define I2C2BRGCLR  0xBF820244
#define I2C2BRGSET  0xBF820248
#define I2C2BRGINV  0xBF82024C
#define I2C2TRN  0xBF820250
#define I2C2TRNCLR  0xBF820254
#define I2C2TRNSET  0xBF820258
#define I2C2TRNINV  0xBF82025C
#define I2C2RCV  0xBF820260
#define I2C2RCVCLR  0xBF820264
#define I2C2RCVSET  0xBF820268
#define I2C2RCVINV  0xBF82026C
#define I2C3CON  0xBF820400
#define I2C3CONCLR  0xBF820404
#define I2C3CONSET  0xBF820408
#define I2C3CONINV  0xBF82040C
#define I2C3STAT  0xBF820410
#define I2C3STATCLR  0xBF820414
#define I2C3STATSET  0xBF820418
#define I2C3STATINV  0xBF82041C
#define I2C3ADD  0xBF820420
#define I2C3ADDCLR  0xBF820424
#define I2C3ADDSET  0xBF820428
#define I2C3ADDINV  0xBF82042C
#define I2C3MSK  0xBF820430
#define I2C3MSKCLR  0xBF820434
#define I2C3MSKSET  0xBF820438
#define I2C3MSKINV  0xBF82043C
#define I2C3BRG  0xBF820440
#define I2C3BRGCLR  0xBF820444
#define I2C3BRGSET  0xBF820448
#define I2C3BRGINV  0xBF82044C
#define I2C3TRN  0xBF820450
#define I2C3TRNCLR  0xBF820454
#define I2C3TRNSET  0xBF820458
#define I2C3TRNINV  0xBF82045C
#define I2C3RCV  0xBF820460
#define I2C3RCVCLR  0xBF820464
#define I2C3RCVSET  0xBF820468
#define I2C3RCVINV  0xBF82046C
#define I2C4CON  0xBF820600
#define I2C4CONCLR  0xBF820604
#define I2C4CONSET  0xBF820608
#define I2C4CONINV  0xBF82060C
#define I2C4STAT  0xBF820610
#define I2C4STATCLR  0xBF820614
#define I2C4STATSET  0xBF820618
#define I2C4STATINV  0xBF82061C
#define I2C4ADD  0xBF820620
#define I2C4ADDCLR  0xBF820624
#define I2C4ADDSET  0xBF820628
#define I2C4ADDINV  0xBF82062C
#define I2C4MSK  0xBF820630
#define I2C4MSKCLR  0xBF820634
#define I2C4MSKSET  0xBF820638
#define I2C4MSKINV  0xBF82063C
#define I2C4BRG  0xBF820640
#define I2C4BRGCLR  0xBF820644
#define I2C4BRGSET  0xBF820648
#define I2C4BRGINV  0xBF82064C
#define I2C4TRN  0xBF820650
#define I2C4TRNCLR  0xBF820654
#define I2C4TRNSET  0xBF820658
#define I2C4TRNINV  0xBF82065C
#define I2C4RCV  0xBF820660
#define I2C4RCVCLR  0xBF820664
#define I2C4RCVSET  0xBF820668
#define I2C4RCVINV  0xBF82066C
#define I2C5CON  0xBF820800
#define I2C5CONCLR  0xBF820804
#define I2C5CONSET  0xBF820808
#define I2C5CONINV  0xBF82080C
#define I2C5STAT  0xBF820810
#define I2C5STATCLR  0xBF820814
#define I2C5STATSET  0xBF820818
#define I2C5STATINV  0xBF82081C
#define I2C5ADD  0xBF820820
#define I2C5ADDCLR  0xBF820824
#define I2C5ADDSET  0xBF820828
#define I2C5ADDINV  0xBF82082C
#define I2C5MSK  0xBF820830
#define I2C5MSKCLR  0xBF820834
#define I2C5MSKSET  0xBF820838
#define I2C5MSKINV  0xBF82083C
#define I2C5BRG  0xBF820840
#define I2C5BRGCLR  0xBF820844
#define I2C5BRGSET  0xBF820848
#define I2C5BRGINV  0xBF82084C
#define I2C5TRN  0xBF820850
#define I2C5TRNCLR  0xBF820854
#define I2C5TRNSET  0xBF820858
#define I2C5TRNINV  0xBF82085C
#define I2C5RCV  0xBF820860
#define I2C5RCVCLR  0xBF820864
#define I2C5RCVSET  0xBF820868
#define I2C5RCVINV  0xBF82086C
#define SPI1CON  0xBF821000
#define SPI1CONCLR  0xBF821004
#define SPI1CONSET  0xBF821008
#define SPI1CONINV  0xBF82100C
#define SPI1STAT  0xBF821010
#define SPI1STATCLR  0xBF821014
#define SPI1STATSET  0xBF821018
#define SPI1STATINV  0xBF82101C
#define SPI1BUF  0xBF821020
#define SPI1BRG  0xBF821030
#define SPI1BRGCLR  0xBF821034
#define SPI1BRGSET  0xBF821038
#define SPI1BRGINV  0xBF82103C
#define SPI1CON2  0xBF821040
#define SPI1CON2CLR  0xBF821044
#define SPI1CON2SET  0xBF821048
#define SPI1CON2INV  0xBF82104C
#define SPI2CON  0xBF821200
#define SPI2CONCLR  0xBF821204
#define SPI2CONSET  0xBF821208
#define SPI2CONINV  0xBF82120C
#define SPI2STAT  0xBF821210
#define SPI2STATCLR  0xBF821214
#define SPI2STATSET  0xBF821218
#define SPI2STATINV  0xBF82121C
#define SPI2BUF  0xBF821220
#define SPI2BRG  0xBF821230
#define SPI2BRGCLR  0xBF821234
#define SPI2BRGSET  0xBF821238
#define SPI2BRGINV  0xBF82123C
#define SPI2CON2  0xBF821240
#define SPI2CON2CLR  0xBF821244
#define SPI2CON2SET  0xBF821248
#define SPI2CON2INV  0xBF82124C
#define SPI3CON  0xBF821400
#define SPI3CONCLR  0xBF821404
#define SPI3CONSET  0xBF821408
#define SPI3CONINV  0xBF82140C
#define SPI3STAT  0xBF821410
#define SPI3STATCLR  0xBF821414
#define SPI3STATSET  0xBF821418
#define SPI3STATINV  0xBF82141C
#define SPI3BUF  0xBF821420
#define SPI3BRG  0xBF821430
#define SPI3BRGCLR  0xBF821434
#define SPI3BRGSET  0xBF821438
#define SPI3BRGINV  0xBF82143C
#define SPI3CON2  0xBF821440
#define SPI3CON2CLR  0xBF821444
#define SPI3CON2SET  0xBF821448
#define SPI3CON2INV  0xBF82144C
#define SPI4CON  0xBF821600
#define SPI4CONCLR  0xBF821604
#define SPI4CONSET  0xBF821608
#define SPI4CONINV  0xBF82160C
#define SPI4STAT  0xBF821610
#define SPI4STATCLR  0xBF821614
#define SPI4STATSET  0xBF821618
#define SPI4STATINV  0xBF82161C
#define SPI4BUF  0xBF821620
#define SPI4BRG  0xBF821630
#define SPI4BRGCLR  0xBF821634
#define SPI4BRGSET  0xBF821638
#define SPI4BRGINV  0xBF82163C
#define SPI4CON2  0xBF821640
#define SPI4CON2CLR  0xBF821644
#define SPI4CON2SET  0xBF821648
#define SPI4CON2INV  0xBF82164C
#define SPI5CON  0xBF821800
#define SPI5CONCLR  0xBF821804
#define SPI5CONSET  0xBF821808
#define SPI5CONINV  0xBF82180C
#define SPI5STAT  0xBF821810
#define SPI5STATCLR  0xBF821814
#define SPI5STATSET  0xBF821818
#define SPI5STATINV  0xBF82181C
#define SPI5BUF  0xBF821820
#define SPI5BRG  0xBF821830
#define SPI5BRGCLR  0xBF821834
#define SPI5BRGSET  0xBF821838
#define SPI5BRGINV  0xBF82183C
#define SPI5CON2  0xBF821840
#define SPI5CON2CLR  0xBF821844
#define SPI5CON2SET  0xBF821848
#define SPI5CON2INV  0xBF82184C
#define SPI6CON  0xBF821A00
#define SPI6CONCLR  0xBF821A04
#define SPI6CONSET  0xBF821A08
#define SPI6CONINV  0xBF821A0C
#define SPI6STAT  0xBF821A10
#define SPI6STATCLR  0xBF821A14
#define SPI6STATSET  0xBF821A18
#define SPI6STATINV  0xBF821A1C
#define SPI6BUF  0xBF821A20
#define SPI6BRG  0xBF821A30
#define SPI6BRGCLR  0xBF821A34
#define SPI6BRGSET  0xBF821A38
#define SPI6BRGINV  0xBF821A3C
#define SPI6CON2  0xBF821A40
#define SPI6CON2CLR  0xBF821A44
#define SPI6CON2SET  0xBF821A48
#define SPI6CON2INV  0xBF821A4C
#define U1MODE  0xBF822000
#define UABMODE  0xBF822000
#define U1MODECLR  0xBF822004
#define UABMODECLR  0xBF822004
#define U1MODESET  0xBF822008
#define UABMODESET  0xBF822008
#define U1MODEINV  0xBF82200C
#define UABMODEINV  0xBF82200C
#define U1STA  0xBF822010
#define UABSTA  0xBF822010
#define U1STACLR  0xBF822014
#define UABSTACLR  0xBF822014
#define U1STASET  0xBF822018
#define UABSTASET  0xBF822018
#define U1STAINV  0xBF82201C
#define UABSTAINV  0xBF82201C
#define U1TXREG  0xBF822020
#define UABTXREG  0xBF822020
#define U1RXREG  0xBF822030
#define UABRXREG  0xBF822030
#define U1BRG  0xBF822040
#define UABBRG  0xBF822040
#define U1BRGCLR  0xBF822044
#define UABBRGCLR  0xBF822044
#define U1BRGSET  0xBF822048
#define UABBRGSET  0xBF822048
#define U1BRGINV  0xBF82204C
#define UABBRGINV  0xBF82204C
#define U2MODE  0xBF822200
#define UCDMODE  0xBF822200
#define U2MODECLR  0xBF822204
#define UCDMODECLR  0xBF822204
#define U2MODESET  0xBF822208
#define UCDMODESET  0xBF822208
#define U2MODEINV  0xBF82220C
#define UCDMODEINV  0xBF82220C
#define U2STA  0xBF822210
#define UCDSTA  0xBF822210
#define U2STACLR  0xBF822214
#define UCDSTACLR  0xBF822214
#define U2STASET  0xBF822218
#define UCDSTASET  0xBF822218
#define U2STAINV  0xBF82221C
#define UCDSTAINV  0xBF82221C
#define U2TXREG  0xBF822220
#define UCDTXREG  0xBF822220
#define U2RXREG  0xBF822230
#define UCDRXREG  0xBF822230
#define U2BRG  0xBF822240
#define UCDBRG  0xBF822240
#define U2BRGCLR  0xBF822244
#define UCDBRGCLR  0xBF822244
#define U2BRGSET  0xBF822248
#define UCDBRGSET  0xBF822248
#define U2BRGINV  0xBF82224C
#define UCDBRGINV  0xBF82224C
#define U3MODE  0xBF822400
#define UEFMODE  0xBF822400
#define U3MODECLR  0xBF822404
#define UEFMODECLR  0xBF822404
#define U3MODESET  0xBF822408
#define UEFMODESET  0xBF822408
#define U3MODEINV  0xBF82240C
#define UEFMODEINV  0xBF82240C
#define U3STA  0xBF822410
#define UEFSTA  0xBF822410
#define U3STACLR  0xBF822414
#define UEFSTACLR  0xBF822414
#define U3STASET  0xBF822418
#define UEFSTASET  0xBF822418
