Embeetle/sa/test/pic32/include/p32mz1024efg144reg.h
#define U3STAINV  0xBF82241C
#define UEFSTAINV  0xBF82241C
#define U3TXREG  0xBF822420
#define UEFTXREG  0xBF822420
#define U3RXREG  0xBF822430
#define UEFRXREG  0xBF822430
#define U3BRG  0xBF822440
#define UEFBRG  0xBF822440
#define U3BRGCLR  0xBF822444
#define UEFBRGCLR  0xBF822444
#define U3BRGSET  0xBF822448
#define UEFBRGSET  0xBF822448
#define U3BRGINV  0xBF82244C
#define UEFBRGINV  0xBF82244C
#define U4MODE  0xBF822600
#define UGHMODE  0xBF822600
#define U4MODECLR  0xBF822604
#define UGHMODECLR  0xBF822604
#define U4MODESET  0xBF822608
#define UGHMODESET  0xBF822608
#define U4MODEINV  0xBF82260C
#define UGHMODEINV  0xBF82260C
#define U4STA  0xBF822610
#define UGHSTA  0xBF822610
#define U4STACLR  0xBF822614
#define UGHSTACLR  0xBF822614
#define U4STASET  0xBF822618
#define UGHSTASET  0xBF822618
#define U4STAINV  0xBF82261C
#define UGHSTAINV  0xBF82261C
#define U4TXREG  0xBF822620
#define UGHTXREG  0xBF822620
#define U4RXREG  0xBF822630
#define UGHRXREG  0xBF822630
#define U4BRG  0xBF822640
#define UGHBRG  0xBF822640
#define U4BRGCLR  0xBF822644
#define UGHBRGCLR  0xBF822644
#define U4BRGSET  0xBF822648
#define UGHBRGSET  0xBF822648
#define U4BRGINV  0xBF82264C
#define UGHBRGINV  0xBF82264C
#define U5MODE  0xBF822800
#define UJKMODE  0xBF822800
#define U5MODECLR  0xBF822804
#define UJKMODECLR  0xBF822804
#define U5MODESET  0xBF822808
#define UJKMODESET  0xBF822808
#define U5MODEINV  0xBF82280C
#define UJKMODEINV  0xBF82280C
#define U5STA  0xBF822810
#define UJKSTA  0xBF822810
#define U5STACLR  0xBF822814
#define UJKSTACLR  0xBF822814
#define U5STASET  0xBF822818
#define UJKSTASET  0xBF822818
#define U5STAINV  0xBF82281C
#define UJKSTAINV  0xBF82281C
#define U5TXREG  0xBF822820
#define UJKTXREG  0xBF822820
#define U5RXREG  0xBF822830
#define UJKRXREG  0xBF822830
#define U5BRG  0xBF822840
#define UJKBRG  0xBF822840
#define U5BRGCLR  0xBF822844
#define UJKBRGCLR  0xBF822844
#define U5BRGSET  0xBF822848
#define UJKBRGSET  0xBF822848
#define U5BRGINV  0xBF82284C
#define UJKBRGINV  0xBF82284C
#define U6MODE  0xBF822A00
#define ULMMODE  0xBF822A00
#define U6MODECLR  0xBF822A04
#define ULMMODECLR  0xBF822A04
#define U6MODESET  0xBF822A08
#define ULMMODESET  0xBF822A08
#define U6MODEINV  0xBF822A0C
#define ULMMODEINV  0xBF822A0C
#define U6STA  0xBF822A10
#define ULMSTA  0xBF822A10
#define U6STACLR  0xBF822A14
#define ULMSTACLR  0xBF822A14
#define U6STASET  0xBF822A18
#define ULMSTASET  0xBF822A18
#define U6STAINV  0xBF822A1C
#define ULMSTAINV  0xBF822A1C
#define U6TXREG  0xBF822A20
#define ULMTXREG  0xBF822A20
#define U6RXREG  0xBF822A30
#define ULMRXREG  0xBF822A30
#define U6BRG  0xBF822A40
#define ULMBRG  0xBF822A40
#define U6BRGCLR  0xBF822A44
#define ULMBRGCLR  0xBF822A44
#define U6BRGSET  0xBF822A48
#define ULMBRGSET  0xBF822A48
#define U6BRGINV  0xBF822A4C
#define ULMBRGINV  0xBF822A4C
#define PMCON  0xBF82E000
#define PMCONCLR  0xBF82E004
#define PMCONSET  0xBF82E008
#define PMCONINV  0xBF82E00C
#define PMMODE  0xBF82E010
#define PMMODECLR  0xBF82E014
#define PMMODESET  0xBF82E018
#define PMMODEINV  0xBF82E01C
#define PMADDR  0xBF82E020
#define PMADDRCLR  0xBF82E024
#define PMADDRSET  0xBF82E028
#define PMADDRINV  0xBF82E02C
#define PMDOUT  0xBF82E030
#define PMDOUTCLR  0xBF82E034
#define PMDOUTSET  0xBF82E038
#define PMDOUTINV  0xBF82E03C
#define PMDIN  0xBF82E040
#define PMDINCLR  0xBF82E044
#define PMDINSET  0xBF82E048
#define PMDININV  0xBF82E04C
#define PMAEN  0xBF82E050
#define PMAENCLR  0xBF82E054
#define PMAENSET  0xBF82E058
#define PMAENINV  0xBF82E05C
#define PMSTAT  0xBF82E060
#define PMSTATCLR  0xBF82E064
#define PMSTATSET  0xBF82E068
#define PMSTATINV  0xBF82E06C
#define PMWADDR  0xBF82E070
#define PMWADDRCLR  0xBF82E074
#define PMWADDRSET  0xBF82E078
#define PMWADDRINV  0xBF82E07C
#define PMRADDR  0xBF82E080
#define PMRADDRCLR  0xBF82E084
#define PMRADDRSET  0xBF82E088
#define PMRADDRINV  0xBF82E08C
#define PMRDIN  0xBF82E090
#define PMRDINCLR  0xBF82E094
#define PMRDINSET  0xBF82E098
#define PMRDININV  0xBF82E09C
#define T1CON  0xBF840000
#define T1CONCLR  0xBF840004
#define T1CONSET  0xBF840008
#define T1CONINV  0xBF84000C
#define TMR1  0xBF840010
#define TMR1CLR  0xBF840014
#define TMR1SET  0xBF840018
#define TMR1INV  0xBF84001C
#define PR1  0xBF840020
#define PR1CLR  0xBF840024
#define PR1SET  0xBF840028
#define PR1INV  0xBF84002C
#define T2CON  0xBF840200
#define T2CONCLR  0xBF840204
#define T2CONSET  0xBF840208
#define T2CONINV  0xBF84020C
#define TMR2  0xBF840210
#define TMR2CLR  0xBF840214
#define TMR2SET  0xBF840218
#define TMR2INV  0xBF84021C
#define PR2  0xBF840220
#define PR2CLR  0xBF840224
#define PR2SET  0xBF840228
#define PR2INV  0xBF84022C
#define T3CON  0xBF840400
#define T3CONCLR  0xBF840404
#define T3CONSET  0xBF840408
#define T3CONINV  0xBF84040C
#define TMR3  0xBF840410
#define TMR3CLR  0xBF840414
#define TMR3SET  0xBF840418
#define TMR3INV  0xBF84041C
#define PR3  0xBF840420
#define PR3CLR  0xBF840424
#define PR3SET  0xBF840428
#define PR3INV  0xBF84042C
#define T4CON  0xBF840600
#define T4CONCLR  0xBF840604
#define T4CONSET  0xBF840608
#define T4CONINV  0xBF84060C
#define TMR4  0xBF840610
#define TMR4CLR  0xBF840614
#define TMR4SET  0xBF840618
#define TMR4INV  0xBF84061C
#define PR4  0xBF840620
#define PR4CLR  0xBF840624
#define PR4SET  0xBF840628
#define PR4INV  0xBF84062C
#define T5CON  0xBF840800
#define T5CONCLR  0xBF840804
#define T5CONSET  0xBF840808
#define T5CONINV  0xBF84080C
#define TMR5  0xBF840810
#define TMR5CLR  0xBF840814
#define TMR5SET  0xBF840818
#define TMR5INV  0xBF84081C
#define PR5  0xBF840820
#define PR5CLR  0xBF840824
#define PR5SET  0xBF840828
#define PR5INV  0xBF84082C
#define T6CON  0xBF840A00
#define T6CONCLR  0xBF840A04
#define T6CONSET  0xBF840A08
#define T6CONINV  0xBF840A0C
#define TMR6  0xBF840A10
#define TMR6CLR  0xBF840A14
#define TMR6SET  0xBF840A18
#define TMR6INV  0xBF840A1C
#define PR6  0xBF840A20
#define PR6CLR  0xBF840A24
#define PR6SET  0xBF840A28
#define PR6INV  0xBF840A2C
#define T7CON  0xBF840C00
#define T7CONCLR  0xBF840C04
#define T7CONSET  0xBF840C08
#define T7CONINV  0xBF840C0C
#define TMR7  0xBF840C10
#define TMR7CLR  0xBF840C14
#define TMR7SET  0xBF840C18
#define TMR7INV  0xBF840C1C
#define PR7  0xBF840C20
#define PR7CLR  0xBF840C24
#define PR7SET  0xBF840C28
#define PR7INV  0xBF840C2C
#define T8CON  0xBF840E00
#define T8CONCLR  0xBF840E04
#define T8CONSET  0xBF840E08
#define T8CONINV  0xBF840E0C
#define TMR8  0xBF840E10
#define TMR8CLR  0xBF840E14
#define TMR8SET  0xBF840E18
#define TMR8INV  0xBF840E1C
#define PR8  0xBF840E20
#define PR8CLR  0xBF840E24
#define PR8SET  0xBF840E28
#define PR8INV  0xBF840E2C
#define T9CON  0xBF841000
#define T9CONCLR  0xBF841004
#define T9CONSET  0xBF841008
#define T9CONINV  0xBF84100C
#define TMR9  0xBF841010
#define TMR9CLR  0xBF841014
#define TMR9SET  0xBF841018
#define TMR9INV  0xBF84101C
#define PR9  0xBF841020
#define PR9CLR  0xBF841024
#define PR9SET  0xBF841028
#define PR9INV  0xBF84102C
#define IC1CON  0xBF842000
#define IC1CONCLR  0xBF842004
#define IC1CONSET  0xBF842008
#define IC1CONINV  0xBF84200C
#define IC1BUF  0xBF842010
#define IC2CON  0xBF842200
#define IC2CONCLR  0xBF842204
#define IC2CONSET  0xBF842208
#define IC2CONINV  0xBF84220C
#define IC2BUF  0xBF842210
#define IC3CON  0xBF842400
#define IC3CONCLR  0xBF842404
#define IC3CONSET  0xBF842408
#define IC3CONINV  0xBF84240C
#define IC3BUF  0xBF842410
#define IC4CON  0xBF842600
#define IC4CONCLR  0xBF842604
#define IC4CONSET  0xBF842608
#define IC4CONINV  0xBF84260C
#define IC4BUF  0xBF842610
#define IC5CON  0xBF842800
#define IC5CONCLR  0xBF842804
#define IC5CONSET  0xBF842808
#define IC5CONINV  0xBF84280C
#define IC5BUF  0xBF842810
#define IC6CON  0xBF842A00
#define IC6CONCLR  0xBF842A04
#define IC6CONSET  0xBF842A08
#define IC6CONINV  0xBF842A0C
#define IC6BUF  0xBF842A10
#define IC7CON  0xBF842C00
#define IC7CONCLR  0xBF842C04
#define IC7CONSET  0xBF842C08
#define IC7CONINV  0xBF842C0C
#define IC7BUF  0xBF842C10
#define IC8CON  0xBF842E00
#define IC8CONCLR  0xBF842E04
#define IC8CONSET  0xBF842E08
#define IC8CONINV  0xBF842E0C
#define IC8BUF  0xBF842E10
#define IC9CON  0xBF843000
#define IC9CONCLR  0xBF843004
#define IC9CONSET  0xBF843008
#define IC9CONINV  0xBF84300C
#define IC9BUF  0xBF843010
#define OC1CON  0xBF844000
#define OC1CONCLR  0xBF844004
#define OC1CONSET  0xBF844008
#define OC1CONINV  0xBF84400C
#define OC1R  0xBF844010
#define OC1RCLR  0xBF844014
#define OC1RSET  0xBF844018
#define OC1RINV  0xBF84401C
#define OC1RS  0xBF844020
#define OC1RSCLR  0xBF844024
#define OC1RSSET  0xBF844028
#define OC1RSINV  0xBF84402C
#define OC2CON  0xBF844200
#define OC2CONCLR  0xBF844204
#define OC2CONSET  0xBF844208
#define OC2CONINV  0xBF84420C
#define OC2R  0xBF844210
#define OC2RCLR  0xBF844214
#define OC2RSET  0xBF844218
#define OC2RINV  0xBF84421C
#define OC2RS  0xBF844220
#define OC2RSCLR  0xBF844224
#define OC2RSSET  0xBF844228
#define OC2RSINV  0xBF84422C
#define OC3CON  0xBF844400
#define OC3CONCLR  0xBF844404
#define OC3CONSET  0xBF844408
#define OC3CONINV  0xBF84440C
#define OC3R  0xBF844410
#define OC3RCLR  0xBF844414
#define OC3RSET  0xBF844418
#define OC3RINV  0xBF84441C
#define OC3RS  0xBF844420
#define OC3RSCLR  0xBF844424
#define OC3RSSET  0xBF844428
#define OC3RSINV  0xBF84442C
#define OC4CON  0xBF844600
#define OC4CONCLR  0xBF844604
#define OC4CONSET  0xBF844608
#define OC4CONINV  0xBF84460C
#define OC4R  0xBF844610
#define OC4RCLR  0xBF844614
#define OC4RSET  0xBF844618
#define OC4RINV  0xBF84461C
#define OC4RS  0xBF844620
#define OC4RSCLR  0xBF844624
#define OC4RSSET  0xBF844628
#define OC4RSINV  0xBF84462C
#define OC5CON  0xBF844800
#define OC5CONCLR  0xBF844804
#define OC5CONSET  0xBF844808
#define OC5CONINV  0xBF84480C
#define OC5R  0xBF844810
#define OC5RCLR  0xBF844814
#define OC5RSET  0xBF844818
#define OC5RINV  0xBF84481C
#define OC5RS  0xBF844820
#define OC5RSCLR  0xBF844824
#define OC5RSSET  0xBF844828
#define OC5RSINV  0xBF84482C
#define OC6CON  0xBF844A00
#define OC6CONCLR  0xBF844A04
#define OC6CONSET  0xBF844A08
#define OC6CONINV  0xBF844A0C
#define OC6R  0xBF844A10
#define OC6RCLR  0xBF844A14
#define OC6RSET  0xBF844A18
#define OC6RINV  0xBF844A1C
#define OC6RS  0xBF844A20
#define OC6RSCLR  0xBF844A24
#define OC6RSSET  0xBF844A28
#define OC6RSINV  0xBF844A2C
#define OC7CON  0xBF844C00
#define OC7CONCLR  0xBF844C04
#define OC7CONSET  0xBF844C08
#define OC7CONINV  0xBF844C0C
#define OC7R  0xBF844C10
#define OC7RCLR  0xBF844C14
#define OC7RSET  0xBF844C18
#define OC7RINV  0xBF844C1C
#define OC7RS  0xBF844C20
#define OC7RSCLR  0xBF844C24
#define OC7RSSET  0xBF844C28
#define OC7RSINV  0xBF844C2C
#define OC8CON  0xBF844E00
#define OC8CONCLR  0xBF844E04
#define OC8CONSET  0xBF844E08
#define OC8CONINV  0xBF844E0C
#define OC8R  0xBF844E10
#define OC8RCLR  0xBF844E14
#define OC8RSET  0xBF844E18
#define OC8RINV  0xBF844E1C
#define OC8RS  0xBF844E20
#define OC8RSCLR  0xBF844E24
#define OC8RSSET  0xBF844E28
#define OC8RSINV  0xBF844E2C
#define OC9CON  0xBF845000
#define OC9CONCLR  0xBF845004
#define OC9CONSET  0xBF845008
#define OC9CONINV  0xBF84500C
#define OC9R  0xBF845010
#define OC9RCLR  0xBF845014
#define OC9RSET  0xBF845018
#define OC9RINV  0xBF84501C
#define OC9RS  0xBF845020
#define OC9RSCLR  0xBF845024
#define OC9RSSET  0xBF845028
#define OC9RSINV  0xBF84502C
#define ADCCON1  0xBF84B000
#define ADCCON2  0xBF84B004
#define ADCCON3  0xBF84B008
#define ADCTRGMODE  0xBF84B00C
#define ADCIMCON1  0xBF84B010
#define ADCIMCON2  0xBF84B014
#define ADCIMCON3  0xBF84B018
#define ADCGIRQEN1  0xBF84B020
#define ADCGIRQEN2  0xBF84B024
#define ADCCSS1  0xBF84B028
#define ADCCSS2  0xBF84B02C
#define ADCDSTAT1  0xBF84B030
#define ADCDSTAT2  0xBF84B034
#define ADCCMPEN1  0xBF84B038
#define ADCCMP1  0xBF84B03C
#define ADCCMPEN2  0xBF84B040
#define ADCCMP2  0xBF84B044
#define ADCCMPEN3  0xBF84B048
#define ADCCMP3  0xBF84B04C
#define ADCCMPEN4  0xBF84B050
#define ADCCMP4  0xBF84B054
#define ADCCMPEN5  0xBF84B058
#define ADCCMP5  0xBF84B05C
#define ADCCMPEN6  0xBF84B060
#define ADCCMP6  0xBF84B064
#define ADCFLTR1  0xBF84B068
#define ADCFLTR2  0xBF84B06C
#define ADCFLTR3  0xBF84B070
#define ADCFLTR4  0xBF84B074
#define ADCFLTR5  0xBF84B078
#define ADCFLTR6  0xBF84B07C
#define ADCTRG1  0xBF84B080
#define ADCTRG2  0xBF84B084
#define ADCTRG3  0xBF84B088
#define ADCCMPCON1  0xBF84B0A0
#define ADCCMPCON2  0xBF84B0A4
#define ADCCMPCON3  0xBF84B0A8
#define ADCCMPCON4  0xBF84B0AC
#define ADCCMPCON5  0xBF84B0B0
#define ADCCMPCON6  0xBF84B0B4
#define ADCFSTAT  0xBF84B0B8
#define ADCFIFO  0xBF84B0BC
#define ADCBASE  0xBF84B0C0
#define ADCTRGSNS  0xBF84B0D0
#define ADC0TIME  0xBF84B0D4
#define ADC1TIME  0xBF84B0D8
#define ADC2TIME  0xBF84B0DC
#define ADC3TIME  0xBF84B0E0
#define ADC4TIME  0xBF84B0E4
#define ADCEIEN1  0xBF84B0F0
#define ADCEIEN2  0xBF84B0F4
#define ADCEISTAT1  0xBF84B0F8
#define ADCEISTAT2  0xBF84B0FC
#define ADCANCON  0xBF84B100
#define ADC0CFG  0xBF84B180
#define ADC1CFG  0xBF84B184
#define ADC2CFG  0xBF84B188
#define ADC3CFG  0xBF84B18C
#define ADC4CFG  0xBF84B190
#define ADC7CFG  0xBF84B19C
#define ADCSYSCFG0  0xBF84B1C0
#define ADCSYSCFG1  0xBF84B1C4
#define ADCDATA0  0xBF84B200
#define ADCDATA1  0xBF84B204
#define ADCDATA2  0xBF84B208
#define ADCDATA3  0xBF84B20C
#define ADCDATA4  0xBF84B210
#define ADCDATA5  0xBF84B214
#define ADCDATA6  0xBF84B218
#define ADCDATA7  0xBF84B21C
#define ADCDATA8  0xBF84B220
#define ADCDATA9  0xBF84B224
#define ADCDATA10  0xBF84B228
#define ADCDATA11  0xBF84B22C
#define ADCDATA12  0xBF84B230
#define ADCDATA13  0xBF84B234
#define ADCDATA14  0xBF84B238
#define ADCDATA15  0xBF84B23C
#define ADCDATA16  0xBF84B240
#define ADCDATA17  0xBF84B244
#define ADCDATA18  0xBF84B248
#define ADCDATA19  0xBF84B24C
#define ADCDATA20  0xBF84B250
#define ADCDATA21  0xBF84B254
#define ADCDATA22  0xBF84B258
#define ADCDATA23  0xBF84B25C
#define ADCDATA24  0xBF84B260
#define ADCDATA25  0xBF84B264
#define ADCDATA26  0xBF84B268
#define ADCDATA27  0xBF84B26C
#define ADCDATA28  0xBF84B270
#define ADCDATA29  0xBF84B274
#define ADCDATA30  0xBF84B278
#define ADCDATA31  0xBF84B27C
#define ADCDATA32  0xBF84B280
#define ADCDATA33  0xBF84B284
#define ADCDATA34  0xBF84B288
#define ADCDATA35  0xBF84B28C
#define ADCDATA36  0xBF84B290
#define ADCDATA37  0xBF84B294
#define ADCDATA38  0xBF84B298
#define ADCDATA39  0xBF84B29C
#define ADCDATA40  0xBF84B2A0
#define ADCDATA41  0xBF84B2A4
#define ADCDATA42  0xBF84B2A8
#define ADCDATA43  0xBF84B2AC
#define ADCDATA44  0xBF84B2B0
#define CM1CON  0xBF84C000
#define CM1CONCLR  0xBF84C004
#define CM1CONSET  0xBF84C008
#define CM1CONINV  0xBF84C00C
#define CM2CON  0xBF84C010
#define CM2CONCLR  0xBF84C014
#define CM2CONSET  0xBF84C018
#define CM2CONINV  0xBF84C01C
#define CMSTAT  0xBF84C060
#define CMSTATCLR  0xBF84C064
#define CMSTATSET  0xBF84C068
#define CMSTATINV  0xBF84C06C
#define ANSELA  0xBF860000
#define ANSELACLR  0xBF860004
#define ANSELASET  0xBF860008
#define ANSELAINV  0xBF86000C
#define TRISA  0xBF860010
#define TRISACLR  0xBF860014
#define TRISASET  0xBF860018
#define TRISAINV  0xBF86001C
#define PORTA  0xBF860020
#define PORTACLR  0xBF860024
#define PORTASET  0xBF860028
#define PORTAINV  0xBF86002C
#define LATA  0xBF860030
#define LATACLR  0xBF860034
#define LATASET  0xBF860038
#define LATAINV  0xBF86003C
#define ODCA  0xBF860040
#define ODCACLR  0xBF860044
#define ODCASET  0xBF860048
#define ODCAINV  0xBF86004C
#define CNPUA  0xBF860050
#define CNPUACLR  0xBF860054
#define CNPUASET  0xBF860058
#define CNPUAINV  0xBF86005C
#define CNPDA  0xBF860060
#define CNPDACLR  0xBF860064
#define CNPDASET  0xBF860068
#define CNPDAINV  0xBF86006C
#define CNCONA  0xBF860070
#define CNCONACLR  0xBF860074
#define CNCONASET  0xBF860078
#define CNCONAINV  0xBF86007C
#define CNENA  0xBF860080
#define CNENACLR  0xBF860084
#define CNENASET  0xBF860088
#define CNENAINV  0xBF86008C
#define CNSTATA  0xBF860090
#define CNSTATACLR  0xBF860094
#define CNSTATASET  0xBF860098
#define CNSTATAINV  0xBF86009C
#define CNNEA  0xBF8600A0
#define CNNEACLR  0xBF8600A4
#define CNNEASET  0xBF8600A8
#define CNNEAINV  0xBF8600AC
#define CNFA  0xBF8600B0
#define CNFACLR  0xBF8600B4
#define CNFASET  0xBF8600B8
#define CNFAINV  0xBF8600BC
#define SRCON0A  0xBF8600C0
#define SRCON0ACLR  0xBF8600C4
#define SRCON0ASET  0xBF8600C8
#define SRCON0AINV  0xBF8600CC
#define SRCON1A  0xBF8600D0
#define SRCON1ACLR  0xBF8600D4
#define SRCON1ASET  0xBF8600D8
#define SRCON1AINV  0xBF8600DC
#define ANSELB  0xBF860100
#define ANSELBCLR  0xBF860104
#define ANSELBSET  0xBF860108
#define ANSELBINV  0xBF86010C
#define TRISB  0xBF860110
#define TRISBCLR  0xBF860114
#define TRISBSET  0xBF860118
#define TRISBINV  0xBF86011C
#define PORTB  0xBF860120
#define PORTBCLR  0xBF860124
#define PORTBSET  0xBF860128
#define PORTBINV  0xBF86012C
#define LATB  0xBF860130
#define LATBCLR  0xBF860134
#define LATBSET  0xBF860138
#define LATBINV  0xBF86013C
#define ODCB  0xBF860140
#define ODCBCLR  0xBF860144
#define ODCBSET  0xBF860148
#define ODCBINV  0xBF86014C
#define CNPUB  0xBF860150
#define CNPUBCLR  0xBF860154
#define CNPUBSET  0xBF860158
#define CNPUBINV  0xBF86015C
#define CNPDB  0xBF860160
#define CNPDBCLR  0xBF860164
#define CNPDBSET  0xBF860168
#define CNPDBINV  0xBF86016C
#define CNCONB  0xBF860170
#define CNCONBCLR  0xBF860174
#define CNCONBSET  0xBF860178
#define CNCONBINV  0xBF86017C
#define CNENB  0xBF860180
#define CNENBCLR  0xBF860184
#define CNENBSET  0xBF860188
#define CNENBINV  0xBF86018C
#define CNSTATB  0xBF860190
#define CNSTATBCLR  0xBF860194
#define CNSTATBSET  0xBF860198
#define CNSTATBINV  0xBF86019C
#define CNNEB  0xBF8601A0
#define CNNEBCLR  0xBF8601A4
#define CNNEBSET  0xBF8601A8
#define CNNEBINV  0xBF8601AC
#define CNFB  0xBF8601B0
#define CNFBCLR  0xBF8601B4
#define CNFBSET  0xBF8601B8
#define CNFBINV  0xBF8601BC
#define SRCON0B  0xBF8601C0
#define SRCON0BCLR  0xBF8601C4
#define SRCON0BSET  0xBF8601C8
#define SRCON0BINV  0xBF8601CC
#define SRCON1B  0xBF8601D0
#define SRCON1BCLR  0xBF8601D4
#define SRCON1BSET  0xBF8601D8
#define SRCON1BINV  0xBF8601DC
#define ANSELC  0xBF860200
#define ANSELCCLR  0xBF860204
#define ANSELCSET  0xBF860208
#define ANSELCINV  0xBF86020C
#define TRISC  0xBF860210
#define TRISCCLR  0xBF860214
#define TRISCSET  0xBF860218
#define TRISCINV  0xBF86021C
#define PORTC  0xBF860220
#define PORTCCLR  0xBF860224
#define PORTCSET  0xBF860228
#define PORTCINV  0xBF86022C
#define LATC  0xBF860230
#define LATCCLR  0xBF860234
#define LATCSET  0xBF860238
#define LATCINV  0xBF86023C
#define ODCC  0xBF860240
#define ODCCCLR  0xBF860244
#define ODCCSET  0xBF860248
#define ODCCINV  0xBF86024C
#define CNPUC  0xBF860250
#define CNPUCCLR  0xBF860254
#define CNPUCSET  0xBF860258
#define CNPUCINV  0xBF86025C
#define CNPDC  0xBF860260
#define CNPDCCLR  0xBF860264
#define CNPDCSET  0xBF860268
#define CNPDCINV  0xBF86026C
#define CNCONC  0xBF860270
#define CNCONCCLR  0xBF860274
#define CNCONCSET  0xBF860278
#define CNCONCINV  0xBF86027C
#define CNENC  0xBF860280
#define CNENCCLR  0xBF860284
#define CNENCSET  0xBF860288
#define CNENCINV  0xBF86028C
#define CNSTATC  0xBF860290
#define CNSTATCCLR  0xBF860294
#define CNSTATCSET  0xBF860298
#define CNSTATCINV  0xBF86029C
#define CNNEC  0xBF8602A0
#define CNNECCLR  0xBF8602A4
#define CNNECSET  0xBF8602A8
#define CNNECINV  0xBF8602AC
#define CNFC  0xBF8602B0
#define CNFCCLR  0xBF8602B4
#define CNFCSET  0xBF8602B8
#define CNFCINV  0xBF8602BC
#define ANSELD  0xBF860300
#define ANSELDCLR  0xBF860304
#define ANSELDSET  0xBF860308
#define ANSELDINV  0xBF86030C
#define TRISD  0xBF860310
#define TRISDCLR  0xBF860314
#define TRISDSET  0xBF860318
#define TRISDINV  0xBF86031C
#define PORTD  0xBF860320
#define PORTDCLR  0xBF860324
#define PORTDSET  0xBF860328
#define PORTDINV  0xBF86032C
#define LATD  0xBF860330
#define LATDCLR  0xBF860334
#define LATDSET  0xBF860338
#define LATDINV  0xBF86033C
#define ODCD  0xBF860340
#define ODCDCLR  0xBF860344
#define ODCDSET  0xBF860348
#define ODCDINV  0xBF86034C
#define CNPUD  0xBF860350
#define CNPUDCLR  0xBF860354
#define CNPUDSET  0xBF860358
#define CNPUDINV  0xBF86035C
#define CNPDD  0xBF860360
#define CNPDDCLR  0xBF860364
#define CNPDDSET  0xBF860368
#define CNPDDINV  0xBF86036C
#define CNCOND  0xBF860370
#define CNCONDCLR  0xBF860374
#define CNCONDSET  0xBF860378
#define CNCONDINV  0xBF86037C
#define CNEND  0xBF860380
#define CNENDCLR  0xBF860384
#define CNENDSET  0xBF860388
#define CNENDINV  0xBF86038C
#define CNSTATD  0xBF860390
#define CNSTATDCLR  0xBF860394
#define CNSTATDSET  0xBF860398
#define CNSTATDINV  0xBF86039C
#define CNNED  0xBF8603A0
#define CNNEDCLR  0xBF8603A4
#define CNNEDSET  0xBF8603A8
#define CNNEDINV  0xBF8603AC
#define CNFD  0xBF8603B0
#define CNFDCLR  0xBF8603B4
#define CNFDSET  0xBF8603B8
#define CNFDINV  0xBF8603BC
#define ANSELE  0xBF860400
#define ANSELECLR  0xBF860404
#define ANSELESET  0xBF860408
#define ANSELEINV  0xBF86040C
#define TRISE  0xBF860410
#define TRISECLR  0xBF860414
#define TRISESET  0xBF860418
#define TRISEINV  0xBF86041C
#define PORTE  0xBF860420
#define PORTECLR  0xBF860424
#define PORTESET  0xBF860428
#define PORTEINV  0xBF86042C
#define LATE  0xBF860430
#define LATECLR  0xBF860434
#define LATESET  0xBF860438
#define LATEINV  0xBF86043C
#define ODCE  0xBF860440
#define ODCECLR  0xBF860444
#define ODCESET  0xBF860448
#define ODCEINV  0xBF86044C
#define CNPUE  0xBF860450
#define CNPUECLR  0xBF860454
#define CNPUESET  0xBF860458
#define CNPUEINV  0xBF86045C
#define CNPDE  0xBF860460
#define CNPDECLR  0xBF860464
#define CNPDESET  0xBF860468
#define CNPDEINV  0xBF86046C
#define CNCONE  0xBF860470
#define CNCONECLR  0xBF860474
#define CNCONESET  0xBF860478
#define CNCONEINV  0xBF86047C
#define CNENE  0xBF860480
#define CNENECLR  0xBF860484
#define CNENESET  0xBF860488
#define CNENEINV  0xBF86048C
#define CNSTATE  0xBF860490
#define CNSTATECLR  0xBF860494
#define CNSTATESET  0xBF860498
#define CNSTATEINV  0xBF86049C
#define CNNEE  0xBF8604A0
#define CNNEECLR  0xBF8604A4
#define CNNEESET  0xBF8604A8
#define CNNEEINV  0xBF8604AC
#define CNFE  0xBF8604B0
#define CNFECLR  0xBF8604B4
#define CNFESET  0xBF8604B8
#define CNFEINV  0xBF8604BC
#define SRCON0E  0xBF8604C0
#define SRCON0ECLR  0xBF8604C4
#define SRCON0ESET  0xBF8604C8
#define SRCON0EINV  0xBF8604CC
#define SRCON1E  0xBF8604D0
#define SRCON1ECLR  0xBF8604D4
#define SRCON1ESET  0xBF8604D8
#define SRCON1EINV  0xBF8604DC
#define ANSELF  0xBF860500
#define ANSELFCLR  0xBF860504
#define ANSELFSET  0xBF860508
#define ANSELFINV  0xBF86050C
#define TRISF  0xBF860510
#define TRISFCLR  0xBF860514
#define TRISFSET  0xBF860518
#define TRISFINV  0xBF86051C
#define PORTF  0xBF860520
#define PORTFCLR  0xBF860524
#define PORTFSET  0xBF860528
#define PORTFINV  0xBF86052C
#define LATF  0xBF860530
#define LATFCLR  0xBF860534
#define LATFSET  0xBF860538
#define LATFINV  0xBF86053C
#define ODCF  0xBF860540
#define ODCFCLR  0xBF860544
#define ODCFSET  0xBF860548
#define ODCFINV  0xBF86054C
#define CNPUF  0xBF860550
#define CNPUFCLR  0xBF860554
#define CNPUFSET  0xBF860558
#define CNPUFINV  0xBF86055C
#define CNPDF  0xBF860560
#define CNPDFCLR  0xBF860564
#define CNPDFSET  0xBF860568
#define CNPDFINV  0xBF86056C
#define CNCONF  0xBF860570
#define CNCONFCLR  0xBF860574
#define CNCONFSET  0xBF860578
#define CNCONFINV  0xBF86057C
#define CNENF  0xBF860580
#define CNENFCLR  0xBF860584
#define CNENFSET  0xBF860588
#define CNENFINV  0xBF86058C
#define CNSTATF  0xBF860590
#define CNSTATFCLR  0xBF860594
#define CNSTATFSET  0xBF860598
#define CNSTATFINV  0xBF86059C
#define CNNEF  0xBF8605A0
#define CNNEFCLR  0xBF8605A4
#define CNNEFSET  0xBF8605A8
#define CNNEFINV  0xBF8605AC
#define CNFF  0xBF8605B0
#define CNFFCLR  0xBF8605B4
#define CNFFSET  0xBF8605B8
#define CNFFINV  0xBF8605BC
#define SRCON0F  0xBF8605C0
#define SRCON0FCLR  0xBF8605C4
#define SRCON0FSET  0xBF8605C8
#define SRCON0FINV  0xBF8605CC
#define SRCON1F  0xBF8605D0
#define SRCON1FCLR  0xBF8605D4
#define SRCON1FSET  0xBF8605D8
#define SRCON1FINV  0xBF8605DC
#define ANSELG  0xBF860600
#define ANSELGCLR  0xBF860604
