Embeetle/sa/test/pic32/include/p32mz1024efg144reg.h
#define ANSELGSET  0xBF860608
#define ANSELGINV  0xBF86060C
#define TRISG  0xBF860610
#define TRISGCLR  0xBF860614
#define TRISGSET  0xBF860618
#define TRISGINV  0xBF86061C
#define PORTG  0xBF860620
#define PORTGCLR  0xBF860624
#define PORTGSET  0xBF860628
#define PORTGINV  0xBF86062C
#define LATG  0xBF860630
#define LATGCLR  0xBF860634
#define LATGSET  0xBF860638
#define LATGINV  0xBF86063C
#define ODCG  0xBF860640
#define ODCGCLR  0xBF860644
#define ODCGSET  0xBF860648
#define ODCGINV  0xBF86064C
#define CNPUG  0xBF860650
#define CNPUGCLR  0xBF860654
#define CNPUGSET  0xBF860658
#define CNPUGINV  0xBF86065C
#define CNPDG  0xBF860660
#define CNPDGCLR  0xBF860664
#define CNPDGSET  0xBF860668
#define CNPDGINV  0xBF86066C
#define CNCONG  0xBF860670
#define CNCONGCLR  0xBF860674
#define CNCONGSET  0xBF860678
#define CNCONGINV  0xBF86067C
#define CNENG  0xBF860680
#define CNENGCLR  0xBF860684
#define CNENGSET  0xBF860688
#define CNENGINV  0xBF86068C
#define CNSTATG  0xBF860690
#define CNSTATGCLR  0xBF860694
#define CNSTATGSET  0xBF860698
#define CNSTATGINV  0xBF86069C
#define CNNEG  0xBF8606A0
#define CNNEGCLR  0xBF8606A4
#define CNNEGSET  0xBF8606A8
#define CNNEGINV  0xBF8606AC
#define CNFG  0xBF8606B0
#define CNFGCLR  0xBF8606B4
#define CNFGSET  0xBF8606B8
#define CNFGINV  0xBF8606BC
#define SRCON0G  0xBF8606C0
#define SRCON0GCLR  0xBF8606C4
#define SRCON0GSET  0xBF8606C8
#define SRCON0GINV  0xBF8606CC
#define SRCON1G  0xBF8606D0
#define SRCON1GCLR  0xBF8606D4
#define SRCON1GSET  0xBF8606D8
#define SRCON1GINV  0xBF8606DC
#define ANSELH  0xBF860700
#define ANSELHCLR  0xBF860704
#define ANSELHSET  0xBF860708
#define ANSELHINV  0xBF86070C
#define TRISH  0xBF860710
#define TRISHCLR  0xBF860714
#define TRISHSET  0xBF860718
#define TRISHINV  0xBF86071C
#define PORTH  0xBF860720
#define PORTHCLR  0xBF860724
#define PORTHSET  0xBF860728
#define PORTHINV  0xBF86072C
#define LATH  0xBF860730
#define LATHCLR  0xBF860734
#define LATHSET  0xBF860738
#define LATHINV  0xBF86073C
#define ODCH  0xBF860740
#define ODCHCLR  0xBF860744
#define ODCHSET  0xBF860748
#define ODCHINV  0xBF86074C
#define CNPUH  0xBF860750
#define CNPUHCLR  0xBF860754
#define CNPUHSET  0xBF860758
#define CNPUHINV  0xBF86075C
#define CNPDH  0xBF860760
#define CNPDHCLR  0xBF860764
#define CNPDHSET  0xBF860768
#define CNPDHINV  0xBF86076C
#define CNCONH  0xBF860770
#define CNCONHCLR  0xBF860774
#define CNCONHSET  0xBF860778
#define CNCONHINV  0xBF86077C
#define CNENH  0xBF860780
#define CNENHCLR  0xBF860784
#define CNENHSET  0xBF860788
#define CNENHINV  0xBF86078C
#define CNSTATH  0xBF860790
#define CNSTATHCLR  0xBF860794
#define CNSTATHSET  0xBF860798
#define CNSTATHINV  0xBF86079C
#define CNNEH  0xBF8607A0
#define CNNEHCLR  0xBF8607A4
#define CNNEHSET  0xBF8607A8
#define CNNEHINV  0xBF8607AC
#define CNFH  0xBF8607B0
#define CNFHCLR  0xBF8607B4
#define CNFHSET  0xBF8607B8
#define CNFHINV  0xBF8607BC
#define ANSELJ  0xBF860800
#define ANSELJCLR  0xBF860804
#define ANSELJSET  0xBF860808
#define ANSELJINV  0xBF86080C
#define TRISJ  0xBF860810
#define TRISJCLR  0xBF860814
#define TRISJSET  0xBF860818
#define TRISJINV  0xBF86081C
#define PORTJ  0xBF860820
#define PORTJCLR  0xBF860824
#define PORTJSET  0xBF860828
#define PORTJINV  0xBF86082C
#define LATJ  0xBF860830
#define LATJCLR  0xBF860834
#define LATJSET  0xBF860838
#define LATJINV  0xBF86083C
#define ODCJ  0xBF860840
#define ODCJCLR  0xBF860844
#define ODCJSET  0xBF860848
#define ODCJINV  0xBF86084C
#define CNPUJ  0xBF860850
#define CNPUJCLR  0xBF860854
#define CNPUJSET  0xBF860858
#define CNPUJINV  0xBF86085C
#define CNPDJ  0xBF860860
#define CNPDJCLR  0xBF860864
#define CNPDJSET  0xBF860868
#define CNPDJINV  0xBF86086C
#define CNCONJ  0xBF860870
#define CNCONJCLR  0xBF860874
#define CNCONJSET  0xBF860878
#define CNCONJINV  0xBF86087C
#define CNENJ  0xBF860880
#define CNENJCLR  0xBF860884
#define CNENJSET  0xBF860888
#define CNENJINV  0xBF86088C
#define CNSTATJ  0xBF860890
#define CNSTATJCLR  0xBF860894
#define CNSTATJSET  0xBF860898
#define CNSTATJINV  0xBF86089C
#define CNNEJ  0xBF8608A0
#define CNNEJCLR  0xBF8608A4
#define CNNEJSET  0xBF8608A8
#define CNNEJINV  0xBF8608AC
#define CNFJ  0xBF8608B0
#define CNFJCLR  0xBF8608B4
#define CNFJSET  0xBF8608B8
#define CNFJINV  0xBF8608BC
#define TRISK  0xBF860910
#define TRISKCLR  0xBF860914
#define TRISKSET  0xBF860918
#define TRISKINV  0xBF86091C
#define PORTK  0xBF860920
#define PORTKCLR  0xBF860924
#define PORTKSET  0xBF860928
#define PORTKINV  0xBF86092C
#define LATK  0xBF860930
#define LATKCLR  0xBF860934
#define LATKSET  0xBF860938
#define LATKINV  0xBF86093C
#define ODCK  0xBF860940
#define ODCKCLR  0xBF860944
#define ODCKSET  0xBF860948
#define ODCKINV  0xBF86094C
#define CNPUK  0xBF860950
#define CNPUKCLR  0xBF860954
#define CNPUKSET  0xBF860958
#define CNPUKINV  0xBF86095C
#define CNPDK  0xBF860960
#define CNPDKCLR  0xBF860964
#define CNPDKSET  0xBF860968
#define CNPDKINV  0xBF86096C
#define CNCONK  0xBF860970
#define CNCONKCLR  0xBF860974
#define CNCONKSET  0xBF860978
#define CNCONKINV  0xBF86097C
#define CNENK  0xBF860980
#define CNENKCLR  0xBF860984
#define CNENKSET  0xBF860988
#define CNENKINV  0xBF86098C
#define CNSTATK  0xBF860990
#define CNSTATKCLR  0xBF860994
#define CNSTATKSET  0xBF860998
#define CNSTATKINV  0xBF86099C
#define CNNEK  0xBF8609A0
#define CNNEKCLR  0xBF8609A4
#define CNNEKSET  0xBF8609A8
#define CNNEKINV  0xBF8609AC
#define CNFK  0xBF8609B0
#define CNFKCLR  0xBF8609B4
#define CNFKSET  0xBF8609B8
#define CNFKINV  0xBF8609BC
#define ETHCON1  0xBF882000
#define ETHCON1CLR  0xBF882004
#define ETHCON1SET  0xBF882008
#define ETHCON1INV  0xBF88200C
#define ETHCON2  0xBF882010
#define ETHCON2CLR  0xBF882014
#define ETHCON2SET  0xBF882018
#define ETHCON2INV  0xBF88201C
#define ETHTXST  0xBF882020
#define ETHTXSTCLR  0xBF882024
#define ETHTXSTSET  0xBF882028
#define ETHTXSTINV  0xBF88202C
#define ETHRXST  0xBF882030
#define ETHRXSTCLR  0xBF882034
#define ETHRXSTSET  0xBF882038
#define ETHRXSTINV  0xBF88203C
#define ETHHT0  0xBF882040
#define ETHHT0CLR  0xBF882044
#define ETHHT0SET  0xBF882048
#define ETHHT0INV  0xBF88204C
#define ETHHT1  0xBF882050
#define ETHHT1CLR  0xBF882054
#define ETHHT1SET  0xBF882058
#define ETHHT1INV  0xBF88205C
#define ETHPMM0  0xBF882060
#define ETHPMM0CLR  0xBF882064
#define ETHPMM0SET  0xBF882068
#define ETHPMM0INV  0xBF88206C
#define ETHPMM1  0xBF882070
#define ETHPMM1CLR  0xBF882074
#define ETHPMM1SET  0xBF882078
#define ETHPMM1INV  0xBF88207C
#define ETHPMCS  0xBF882080
#define ETHPMCSCLR  0xBF882084
#define ETHPMCSSET  0xBF882088
#define ETHPMCSINV  0xBF88208C
#define ETHPMO  0xBF882090
#define ETHPMOCLR  0xBF882094
#define ETHPMOSET  0xBF882098
#define ETHPMOINV  0xBF88209C
#define ETHRXFC  0xBF8820A0
#define ETHRXFCCLR  0xBF8820A4
#define ETHRXFCSET  0xBF8820A8
#define ETHRXFCINV  0xBF8820AC
#define ETHRXWM  0xBF8820B0
#define ETHRXWMCLR  0xBF8820B4
#define ETHRXWMSET  0xBF8820B8
#define ETHRXWMINV  0xBF8820BC
#define ETHIEN  0xBF8820C0
#define ETHIENCLR  0xBF8820C4
#define ETHIENSET  0xBF8820C8
#define ETHIENINV  0xBF8820CC
#define ETHIRQ  0xBF8820D0
#define ETHIRQCLR  0xBF8820D4
#define ETHIRQSET  0xBF8820D8
#define ETHIRQINV  0xBF8820DC
#define ETHSTAT  0xBF8820E0
#define ETHSTATCLR  0xBF8820E4
#define ETHSTATSET  0xBF8820E8
#define ETHSTATINV  0xBF8820EC
#define ETHRXOVFLOW  0xBF882100
#define ETHRXOVFLOWCLR  0xBF882104
#define ETHRXOVFLOWSET  0xBF882108
#define ETHRXOVFLOWINV  0xBF88210C
#define ETHFRMTXOK  0xBF882110
#define ETHFRMTXOKCLR  0xBF882114
#define ETHFRMTXOKSET  0xBF882118
#define ETHFRMTXOKINV  0xBF88211C
#define ETHSCOLFRM  0xBF882120
#define ETHSCOLFRMCLR  0xBF882124
#define ETHSCOLFRMSET  0xBF882128
#define ETHSCOLFRMINV  0xBF88212C
#define ETHMCOLFRM  0xBF882130
#define ETHMCOLFRMCLR  0xBF882134
#define ETHMCOLFRMSET  0xBF882138
#define ETHMCOLFRMINV  0xBF88213C
#define ETHFRMRXOK  0xBF882140
#define ETHFRMRXOKCLR  0xBF882144
#define ETHFRMRXOKSET  0xBF882148
#define ETHFRMRXOKINV  0xBF88214C
#define ETHFCSERR  0xBF882150
#define ETHFCSERRCLR  0xBF882154
#define ETHFCSERRSET  0xBF882158
#define ETHFCSERRINV  0xBF88215C
#define ETHALGNERR  0xBF882160
#define ETHALGNERRCLR  0xBF882164
#define ETHALGNERRSET  0xBF882168
#define ETHALGNERRINV  0xBF88216C
#define EMAC1CFG1  0xBF882200
#define EMACxCFG1  0xBF882200
#define EMAC1CFG1CLR  0xBF882204
#define EMACxCFG1CLR  0xBF882204
#define EMAC1CFG1SET  0xBF882208
#define EMACxCFG1SET  0xBF882208
#define EMAC1CFG1INV  0xBF88220C
#define EMACxCFG1INV  0xBF88220C
#define EMAC1CFG2  0xBF882210
#define EMACxCFG2  0xBF882210
#define EMAC1CFG2CLR  0xBF882214
#define EMACxCFG2CLR  0xBF882214
#define EMAC1CFG2SET  0xBF882218
#define EMACxCFG2SET  0xBF882218
#define EMAC1CFG2INV  0xBF88221C
#define EMACxCFG2INV  0xBF88221C
#define EMAC1IPGT  0xBF882220
#define EMACxIPGT  0xBF882220
#define EMAC1IPGTCLR  0xBF882224
#define EMACxIPGTCLR  0xBF882224
#define EMAC1IPGTSET  0xBF882228
#define EMACxIPGTSET  0xBF882228
#define EMAC1IPGTINV  0xBF88222C
#define EMACxIPGTINV  0xBF88222C
#define EMAC1IPGR  0xBF882230
#define EMACxIPGR  0xBF882230
#define EMAC1IPGRCLR  0xBF882234
#define EMACxIPGRCLR  0xBF882234
#define EMAC1IPGRSET  0xBF882238
#define EMACxIPGRSET  0xBF882238
#define EMAC1IPGRINV  0xBF88223C
#define EMACxIPGRINV  0xBF88223C
#define EMAC1CLRT  0xBF882240
#define EMACxCLRT  0xBF882240
#define EMAC1CLRTCLR  0xBF882244
#define EMACxCLRTCLR  0xBF882244
#define EMAC1CLRTSET  0xBF882248
#define EMACxCLRTSET  0xBF882248
#define EMAC1CLRTINV  0xBF88224C
#define EMACxCLRTINV  0xBF88224C
#define EMAC1MAXF  0xBF882250
#define EMACxMAXF  0xBF882250
#define EMAC1MAXFCLR  0xBF882254
#define EMACxMAXFCLR  0xBF882254
#define EMAC1MAXFSET  0xBF882258
#define EMACxMAXFSET  0xBF882258
#define EMAC1MAXFINV  0xBF88225C
#define EMACxMAXFINV  0xBF88225C
#define EMAC1SUPP  0xBF882260
#define EMACxSUPP  0xBF882260
#define EMAC1SUPPCLR  0xBF882264
#define EMACxSUPPCLR  0xBF882264
#define EMAC1SUPPSET  0xBF882268
#define EMACxSUPPSET  0xBF882268
#define EMAC1SUPPINV  0xBF88226C
#define EMACxSUPPINV  0xBF88226C
#define EMAC1TEST  0xBF882270
#define EMACxTEST  0xBF882270
#define EMAC1TESTCLR  0xBF882274
#define EMACxTESTCLR  0xBF882274
#define EMAC1TESTSET  0xBF882278
#define EMACxTESTSET  0xBF882278
#define EMAC1TESTINV  0xBF88227C
#define EMACxTESTINV  0xBF88227C
#define EMAC1MCFG  0xBF882280
#define EMACxMCFG  0xBF882280
#define EMAC1MCFGCLR  0xBF882284
#define EMACxMCFGCLR  0xBF882284
#define EMAC1MCFGSET  0xBF882288
#define EMACxMCFGSET  0xBF882288
#define EMAC1MCFGINV  0xBF88228C
#define EMACxMCFGINV  0xBF88228C
#define EMAC1MCMD  0xBF882290
#define EMACxMCMD  0xBF882290
#define EMAC1MCMDCLR  0xBF882294
#define EMACxMCMDCLR  0xBF882294
#define EMAC1MCMDSET  0xBF882298
#define EMACxMCMDSET  0xBF882298
#define EMAC1MCMDINV  0xBF88229C
#define EMACxMCMDINV  0xBF88229C
#define EMAC1MADR  0xBF8822A0
#define EMACxMADR  0xBF8822A0
#define EMAC1MADRCLR  0xBF8822A4
#define EMACxMADRCLR  0xBF8822A4
#define EMAC1MADRSET  0xBF8822A8
#define EMACxMADRSET  0xBF8822A8
#define EMAC1MADRINV  0xBF8822AC
#define EMACxMADRINV  0xBF8822AC
#define EMAC1MWTD  0xBF8822B0
#define EMACxMWTD  0xBF8822B0
#define EMAC1MWTDCLR  0xBF8822B4
#define EMACxMWTDCLR  0xBF8822B4
#define EMAC1MWTDSET  0xBF8822B8
#define EMACxMWTDSET  0xBF8822B8
#define EMAC1MWTDINV  0xBF8822BC
#define EMACxMWTDINV  0xBF8822BC
#define EMAC1MRDD  0xBF8822C0
#define EMACxMRDD  0xBF8822C0
#define EMAC1MRDDCLR  0xBF8822C4
#define EMACxMRDDCLR  0xBF8822C4
#define EMAC1MRDDSET  0xBF8822C8
#define EMACxMRDDSET  0xBF8822C8
#define EMAC1MRDDINV  0xBF8822CC
#define EMACxMRDDINV  0xBF8822CC
#define EMAC1MIND  0xBF8822D0
#define EMACxMIND  0xBF8822D0
#define EMAC1MINDCLR  0xBF8822D4
#define EMACxMINDCLR  0xBF8822D4
#define EMAC1MINDSET  0xBF8822D8
#define EMACxMINDSET  0xBF8822D8
#define EMAC1MINDINV  0xBF8822DC
#define EMACxMINDINV  0xBF8822DC
#define EMAC1SA0  0xBF882300
#define EMACxSA0  0xBF882300
#define EMAC1SA0CLR  0xBF882304
#define EMACxSA0CLR  0xBF882304
#define EMAC1SA0SET  0xBF882308
#define EMACxSA0SET  0xBF882308
#define EMAC1SA0INV  0xBF88230C
#define EMACxSA0INV  0xBF88230C
#define EMAC1SA1  0xBF882310
#define EMACxSA1  0xBF882310
#define EMAC1SA1CLR  0xBF882314
#define EMACxSA1CLR  0xBF882314
#define EMAC1SA1SET  0xBF882318
#define EMACxSA1SET  0xBF882318
#define EMAC1SA1INV  0xBF88231C
#define EMACxSA1INV  0xBF88231C
#define EMAC1SA2  0xBF882320
#define EMACxSA2  0xBF882320
#define EMAC1SA2CLR  0xBF882324
#define EMACxSA2CLR  0xBF882324
#define EMAC1SA2SET  0xBF882328
#define EMACxSA2SET  0xBF882328
#define EMAC1SA2INV  0xBF88232C
#define EMACxSA2INV  0xBF88232C
#define USBCRCON  0xBF884000
#define PRECON  0xBF8E0000
#define PRECONCLR  0xBF8E0004
#define PRECONSET  0xBF8E0008
#define PRECONINV  0xBF8E000C
#define PRESTAT  0xBF8E0010
#define PRESTATCLR  0xBF8E0014
#define PRESTATSET  0xBF8E0018
#define PRESTATINV  0xBF8E001C
#define EBICS0  0xBF8E1014
#define EBICS1  0xBF8E1018
#define EBICS2  0xBF8E101C
#define EBICS3  0xBF8E1020
#define EBIMSK0  0xBF8E1054
#define EBIMSK1  0xBF8E1058
#define EBIMSK2  0xBF8E105C
#define EBIMSK3  0xBF8E1060
#define EBISMT0  0xBF8E1094
#define EBISMT1  0xBF8E1098
#define EBISMT2  0xBF8E109C
#define EBIFTRPD  0xBF8E10A0
#define EBISMCON  0xBF8E10A4
#define SQI1XCON1  0xBF8E2000
#define SQI1XCON2  0xBF8E2004
#define SQI1CFG  0xBF8E2008
#define SQI1CON  0xBF8E200C
#define SQI1CLKCON  0xBF8E2010
#define SQI1CMDTHR  0xBF8E2014
#define SQI1INTTHR  0xBF8E2018
#define SQI1INTEN  0xBF8E201C
#define SQI1INTSTAT  0xBF8E2020
#define SQI1TXDATA  0xBF8E2024
#define SQI1RXDATA  0xBF8E2028
#define SQI1STAT1  0xBF8E202C
#define SQI1STAT2  0xBF8E2030
#define SQI1BDCON  0xBF8E2034
#define SQI1BDCURADD  0xBF8E2038
#define SQI1BDBASEADD  0xBF8E2040
#define SQI1BDSTAT  0xBF8E2044
#define SQI1BDPOLLCON  0xBF8E2048
#define SQI1BDTXDSTAT  0xBF8E204C
#define SQI1BDRXDSTAT  0xBF8E2050
#define SQI1THR  0xBF8E2054
#define SQI1INTSIGEN  0xBF8E2058
#define SQI1TAPCON  0xBF8E205C
#define SQI1MEMSTAT  0xBF8E2060
#define SQI1XCON3  0xBF8E2064
#define SQI1XCON4  0xBF8E2068
#define USBCSR0  0xBF8E3000
#define USBCSR1  0xBF8E3004
#define USBCSR2  0xBF8E3008
#define USBCSR3  0xBF8E300C
#define USBIENCSR1  0xBF8E3014
#define USBFIFO0  0xBF8E3020
#define USBFIFO1  0xBF8E3024
#define USBFIFO2  0xBF8E3028
#define USBFIFO3  0xBF8E302C
#define USBFIFO4  0xBF8E3030
#define USBFIFO5  0xBF8E3034
#define USBFIFO6  0xBF8E3038
#define USBFIFO7  0xBF8E303C
#define USBOTG  0xBF8E3060
#define USBFIFOA  0xBF8E3064
#define USBHWVER  0xBF8E306C
#define USBINFO  0xBF8E3078
#define USBEOFRST  0xBF8E307C
#define USBE0TXA  0xBF8E3080
#define USBE0RXA  0xBF8E3084
#define USBE1TXA  0xBF8E3088
#define USBE1RXA  0xBF8E308C
#define USBE2TXA  0xBF8E3090
#define USBE2RXA  0xBF8E3094
#define USBE3TXA  0xBF8E3098
#define USBE3RXA  0xBF8E309C
#define USBE4TXA  0xBF8E30A0
#define USBE4RXA  0xBF8E30A4
#define USBE5TXA  0xBF8E30A8
#define USBE5RXA  0xBF8E30AC
#define USBE6TXA  0xBF8E30B0
#define USBE6RXA  0xBF8E30B4
#define USBE7TXA  0xBF8E30B8
#define USBE7RXA  0xBF8E30BC
#define USBE0CSR0  0xBF8E3100
#define USBE0CSR2  0xBF8E3108
#define USBE0CSR3  0xBF8E310C
#define USBE1CSR0  0xBF8E3110
#define USBE1CSR1  0xBF8E3114
#define USBE1CSR2  0xBF8E3118
#define USBE1CSR3  0xBF8E311C
#define USBE2CSR0  0xBF8E3120
#define USBE2CSR1  0xBF8E3124
#define USBE2CSR2  0xBF8E3128
#define USBE2CSR3  0xBF8E312C
#define USBE3CSR0  0xBF8E3130
#define USBE3CSR1  0xBF8E3134
#define USBE3CSR2  0xBF8E3138
#define USBE3CSR3  0xBF8E313C
#define USBE4CSR0  0xBF8E3140
#define USBE4CSR1  0xBF8E3144
#define USBE4CSR2  0xBF8E3148
#define USBE4CSR3  0xBF8E314C
#define USBE5CSR0  0xBF8E3150
#define USBE5CSR1  0xBF8E3154
#define USBE5CSR2  0xBF8E3158
#define USBE5CSR3  0xBF8E315C
#define USBE6CSR0  0xBF8E3160
#define USBE6CSR1  0xBF8E3164
#define USBE6CSR2  0xBF8E3168
#define USBE6CSR3  0xBF8E316C
#define USBE7CSR0  0xBF8E3170
#define USBE7CSR1  0xBF8E3174
#define USBE7CSR2  0xBF8E3178
#define USBE7CSR3  0xBF8E317C
#define USBDMAINT  0xBF8E3200
#define USBDMA1C  0xBF8E3204
#define USBDMA1A  0xBF8E3208
#define USBDMA1N  0xBF8E320C
#define USBDMA2C  0xBF8E3214
#define USBDMA2A  0xBF8E3218
#define USBDMA2N  0xBF8E321C
#define USBDMA3C  0xBF8E3224
#define USBDMA3A  0xBF8E3228
#define USBDMA3N  0xBF8E322C
#define USBDMA4C  0xBF8E3234
#define USBDMA4A  0xBF8E3238
#define USBDMA4N  0xBF8E323C
#define USBDMA5C  0xBF8E3244
#define USBDMA5A  0xBF8E3248
#define USBDMA5N  0xBF8E324C
#define USBDMA6C  0xBF8E3254
#define USBDMA6A  0xBF8E3258
#define USBDMA6N  0xBF8E325C
#define USBDMA7C  0xBF8E3264
#define USBDMA7A  0xBF8E3268
#define USBDMA7N  0xBF8E326C
#define USBDMA8C  0xBF8E3274
#define USBDMA8A  0xBF8E3278
#define USBDMA8N  0xBF8E327C
#define USBE1RPC  0xBF8E3304
#define USBE2RPC  0xBF8E3308
#define USBE3RPC  0xBF8E330C
#define USBE4RPC  0xBF8E3310
#define USBE5RPC  0xBF8E3314
#define USBE6RPC  0xBF8E3318
#define USBE7RPC  0xBF8E331C
#define USBDPBFD  0xBF8E3340
#define USBTMCON1  0xBF8E3344
#define USBTMCON2  0xBF8E3348
#define USBLPMR1  0xBF8E3360
#define USBLMPR2  0xBF8E3364
#define USBLPMP2  0xBF8E3364
#define RNGVER  0xBF8E6000
#define RNGCON  0xBF8E6004
#define RNGPOLY1  0xBF8E6008
#define RNGPOLY2  0xBF8E600C
#define RNGNUMGEN1  0xBF8E6010
#define RNGNUMGEN2  0xBF8E6014
#define RNGSEED1  0xBF8E6018
#define RNGSEED2  0xBF8E601C
#define RNGCNT  0xBF8E6020
#define SBFLAG  0xBF8F0510
#define SBT0ELOG1  0xBF8F8020
#define SBT0ELOG2  0xBF8F8024
#define SBT0ECON  0xBF8F8028
#define SBT0ECLRS  0xBF8F8030
#define SBT0ECLRM  0xBF8F8038
#define SBT0REG0  0xBF8F8040
#define SBT0RD0  0xBF8F8050
#define SBT0WR0  0xBF8F8058
#define SBT0REG1  0xBF8F8060
#define SBT0RD1  0xBF8F8070
#define SBT0WR1  0xBF8F8078
#define SBT1ELOG1  0xBF8F8420
#define SBT1ELOG2  0xBF8F8424
#define SBT1ECON  0xBF8F8428
#define SBT1ECLRS  0xBF8F8430
#define SBT1ECLRM  0xBF8F8438
#define SBT1REG0  0xBF8F8440
#define SBT1RD0  0xBF8F8450
#define SBT1WR0  0xBF8F8458
#define SBT1REG2  0xBF8F8480
#define SBT1RD2  0xBF8F8490
#define SBT1WR2  0xBF8F8498
#define SBT1REG3  0xBF8F84A0
#define SBT1RD3  0xBF8F84B0
#define SBT1WR3  0xBF8F84B8
#define SBT1REG4  0xBF8F84C0
#define SBT1RD4  0xBF8F84D0
#define SBT1WR4  0xBF8F84D8
#define SBT1REG5  0xBF8F84E0
#define SBT1RD5  0xBF8F84F0
#define SBT1WR5  0xBF8F84F8
#define SBT1REG6  0xBF8F8500
#define SBT1RD6  0xBF8F8510
#define SBT1WR6  0xBF8F8518
#define SBT1REG7  0xBF8F8520
#define SBT1RD7  0xBF8F8530
#define SBT1WR7  0xBF8F8538
#define SBT1REG8  0xBF8F8540
#define SBT1RD8  0xBF8F8550
#define SBT1WR8  0xBF8F8558
#define SBT2ELOG1  0xBF8F8820
#define SBT2ELOG2  0xBF8F8824
#define SBT2ECON  0xBF8F8828
#define SBT2ECLRS  0xBF8F8830
#define SBT2ECLRM  0xBF8F8838
#define SBT2REG0  0xBF8F8840
#define SBT2RD0  0xBF8F8850
#define SBT2WR0  0xBF8F8858
#define SBT2REG1  0xBF8F8860
#define SBT2RD1  0xBF8F8870
#define SBT2WR1  0xBF8F8878
#define SBT2REG2  0xBF8F8880
#define SBT2RD2  0xBF8F8890
#define SBT2WR2  0xBF8F8898
#define SBT3ELOG1  0xBF8F8C20
#define SBT3ELOG2  0xBF8F8C24
#define SBT3ECON  0xBF8F8C28
#define SBT3ECLRS  0xBF8F8C30
#define SBT3ECLRM  0xBF8F8C38
#define SBT3REG0  0xBF8F8C40
#define SBT3RD0  0xBF8F8C50
#define SBT3WR0  0xBF8F8C58
#define SBT3REG1  0xBF8F8C60
#define SBT3RD1  0xBF8F8C70
#define SBT3WR1  0xBF8F8C78
#define SBT3REG2  0xBF8F8C80
#define SBT3RD2  0xBF8F8C90
#define SBT3WR2  0xBF8F8C98
#define SBT4ELOG1  0xBF8F9020
#define SBT4ELOG2  0xBF8F9024
#define SBT4ECON  0xBF8F9028
#define SBT4ECLRS  0xBF8F9030
#define SBT4ECLRM  0xBF8F9038
#define SBT4REG0  0xBF8F9040
#define SBT4RD0  0xBF8F9050
#define SBT4WR0  0xBF8F9058
#define SBT4REG2  0xBF8F9080
#define SBT4RD2  0xBF8F9090
#define SBT4WR2  0xBF8F9098
#define SBT5ELOG1  0xBF8F9420
#define SBT5ELOG2  0xBF8F9424
#define SBT5ECON  0xBF8F9428
#define SBT5ECLRS  0xBF8F9430
#define SBT5ECLRM  0xBF8F9438
#define SBT5REG0  0xBF8F9440
#define SBT5RD0  0xBF8F9450
#define SBT5WR0  0xBF8F9458
#define SBT5REG1  0xBF8F9460
#define SBT5RD1  0xBF8F9470
#define SBT5WR1  0xBF8F9478
#define SBT5REG2  0xBF8F9480
#define SBT5RD2  0xBF8F9490
#define SBT5WR2  0xBF8F9498
#define SBT6ELOG1  0xBF8F9820
#define SBT6ELOG2  0xBF8F9824
#define SBT6ECON  0xBF8F9828
#define SBT6ECLRS  0xBF8F9830
#define SBT6ECLRM  0xBF8F9838
#define SBT6REG0  0xBF8F9840
#define SBT6RD0  0xBF8F9850
#define SBT6WR0  0xBF8F9858
#define SBT6REG1  0xBF8F9860
#define SBT6RD1  0xBF8F9870
#define SBT6WR1  0xBF8F9878
#define SBT7ELOG1  0xBF8F9C20
#define SBT7ELOG2  0xBF8F9C24
#define SBT7ECON  0xBF8F9C28
#define SBT7ECLRS  0xBF8F9C30
#define SBT7ECLRM  0xBF8F9C38
#define SBT7REG0  0xBF8F9C40
#define SBT7RD0  0xBF8F9C50
#define SBT7WR0  0xBF8F9C58
#define SBT7REG1  0xBF8F9C60
#define SBT7RD1  0xBF8F9C70
#define SBT7WR1  0xBF8F9C78
#define SBT8ELOG1  0xBF8FA020
#define SBT8ELOG2  0xBF8FA024
#define SBT8ECON  0xBF8FA028
#define SBT8ECLRS  0xBF8FA030
#define SBT8ECLRM  0xBF8FA038
#define SBT8REG0  0xBF8FA040
#define SBT8RD0  0xBF8FA050
#define SBT8WR0  0xBF8FA058
#define SBT8REG1  0xBF8FA060
#define SBT8RD1  0xBF8FA070
#define SBT8WR1  0xBF8FA078
#define SBT9ELOG1  0xBF8FA420
#define SBT9ELOG2  0xBF8FA424
#define SBT9ECON  0xBF8FA428
#define SBT9ECLRS  0xBF8FA430
#define SBT9ECLRM  0xBF8FA438
#define SBT9REG0  0xBF8FA440
#define SBT9RD0  0xBF8FA450
#define SBT9WR0  0xBF8FA458
#define SBT9REG1  0xBF8FA460
#define SBT9RD1  0xBF8FA470
#define SBT9WR1  0xBF8FA478
#define SBT10ELOG1  0xBF8FA820
#define SBT10ELOG2  0xBF8FA824
#define SBT10ECON  0xBF8FA828
#define SBT10ECLRS  0xBF8FA830
#define SBT10ECLRM  0xBF8FA838
#define SBT10REG0  0xBF8FA840
#define SBT10RD0  0xBF8FA850
#define SBT10WR0  0xBF8FA858
#define SBT11ELOG1  0xBF8FAC20
#define SBT11ELOG2  0xBF8FAC24
#define SBT11ECON  0xBF8FAC28
#define SBT11ECLRS  0xBF8FAC30
#define SBT11ECLRM  0xBF8FAC38
#define SBT11REG0  0xBF8FAC40
#define SBT11RD0  0xBF8FAC50
#define SBT11WR0  0xBF8FAC58
#define SBT11REG1  0xBF8FAC60
#define SBT11RD1  0xBF8FAC70
#define SBT11WR1  0xBF8FAC78
#define SBT12ELOG1  0xBF8FB020
#define SBT12ELOG2  0xBF8FB024
#define SBT12ECON  0xBF8FB028
#define SBT12ECLRS  0xBF8FB030
#define SBT12ECLRM  0xBF8FB038
#define SBT12REG0  0xBF8FB040
#define SBT12RD0  0xBF8FB050
#define SBT12WR0  0xBF8FB058
#define SBT13ELOG1  0xBF8FB420
#define SBT13ELOG2  0xBF8FB424
#define SBT13ECON  0xBF8FB428
#define SBT13ECLRS  0xBF8FB430
#define SBT13ECLRM  0xBF8FB438
#define SBT13REG0  0xBF8FB440
#define SBT13RD0  0xBF8FB450
#define SBT13WR0  0xBF8FB458
#define USBIE0CSR0  0xBF8E3010
#define USBIENCSR0  0xBF8E3010
#define USBIE0CSR2  0xBF8E3018
#define USBIENCSR2  0xBF8E3018
#define USBIE0CSR3  0xBF8E301C
#define USBIENCSR3  0xBF8E301C
#define DEVCFG3  0xBFC0FFC0
#define DEVCFG2  0xBFC0FFC4
#define DEVCFG1  0xBFC0FFC8
#define DEVCFG0  0xBFC0FFCC
#define DEVCP3  0xBFC0FFD0
#define DEVCP2  0xBFC0FFD4
#define DEVCP1  0xBFC0FFD8
#define DEVCP0  0xBFC0FFDC
#define DEVSIGN3  0xBFC0FFE0
#define DEVSIGN2  0xBFC0FFE4
#define DEVSIGN1  0xBFC0FFE8
#define DEVSIGN0  0xBFC0FFEC
#define SEQ3  0xBFC0FFF0
#define SEQ2  0xBFC0FFF4
#define SEQ1  0xBFC0FFF8
#define SEQ0  0xBFC0FFFC
#define DEVADC0  0xBFC54000
#define DEVADC1  0xBFC54004
#define DEVADC2  0xBFC54008
#define DEVADC3  0xBFC5400C
#define DEVADC4  0xBFC54010
#define DEVADC7  0xBFC5401C
#define DEVSN0  0xBFC54020
#define DEVSN1  0xBFC54024
#define ADEVCFG3  0xBFC0FF40
#define ADEVCFG2  0xBFC0FF44
#define ADEVCFG1  0xBFC0FF48
#define ADEVCFG0  0xBFC0FF4C
#define ADEVCP3  0xBFC0FF50
#define ADEVCP2  0xBFC0FF54
#define ADEVCP1  0xBFC0FF58
#define ADEVCP0  0xBFC0FF5C
#define ADEVSIGN3  0xBFC0FF60
#define ADEVSIGN2  0xBFC0FF64
#define ADEVSIGN1  0xBFC0FF68
#define ADEVSIGN0  0xBFC0FF6C
#define ASEQ3  0xBFC0FF70
#define ASEQ2  0xBFC0FF74
#define ASEQ1  0xBFC0FF78
#define ASEQ0  0xBFC0FF7C
#define AUBADEVCFG3  0xBFC2FF40
#define AUBADEVCFG2  0xBFC2FF44
#define AUBADEVCFG1  0xBFC2FF48
#define AUBADEVCFG0  0xBFC2FF4C
#define AUBADEVCP3  0xBFC2FF50
#define AUBADEVCP2  0xBFC2FF54
#define AUBADEVCP1  0xBFC2FF58
#define AUBADEVCP0  0xBFC2FF5C
#define AUBADEVSIGN3  0xBFC2FF60
#define AUBADEVSIGN2  0xBFC2FF64
#define AUBADEVSIGN1  0xBFC2FF68
