Embeetle/sa/test/pic32/include/p32mz1024efg144reg.h
#define AUBADEVSIGN0  0xBFC2FF6C
#define AUBASEQ3  0xBFC2FF70
#define AUBASEQ2  0xBFC2FF74
#define AUBASEQ1  0xBFC2FF78
#define AUBASEQ0  0xBFC2FF7C
#define UBADEVCFG3  0xBFC2FFC0
#define UBADEVCFG2  0xBFC2FFC4
#define UBADEVCFG1  0xBFC2FFC8
#define UBADEVCFG0  0xBFC2FFCC
#define UBADEVCP3  0xBFC2FFD0
#define UBADEVCP2  0xBFC2FFD4
#define UBADEVCP1  0xBFC2FFD8
#define UBADEVCP0  0xBFC2FFDC
#define UBADEVSIGN3  0xBFC2FFE0
#define UBADEVSIGN2  0xBFC2FFE4
#define UBADEVSIGN1  0xBFC2FFE8
#define UBADEVSIGN0  0xBFC2FFEC
#define UBASEQ3  0xBFC2FFF0
#define UBASEQ2  0xBFC2FFF4
#define UBASEQ1  0xBFC2FFF8
#define UBASEQ0  0xBFC2FFFC
#define ABF1DEVCFG3  0xBFC4FF40
#define ABF1DEVCFG2  0xBFC4FF44
#define ABF1DEVCFG1  0xBFC4FF48
#define ABF1DEVCFG0  0xBFC4FF4C
#define ABF1DEVCP3  0xBFC4FF50
#define ABF1DEVCP2  0xBFC4FF54
#define ABF1DEVCP1  0xBFC4FF58
#define ABF1DEVCP0  0xBFC4FF5C
#define ABF1DEVSIGN3  0xBFC4FF60
#define ABF1DEVSIGN2  0xBFC4FF64
#define ABF1DEVSIGN1  0xBFC4FF68
#define ABF1DEVSIGN0  0xBFC4FF6C
#define ABF1SEQ3  0xBFC4FF70
#define ABF1SEQ2  0xBFC4FF74
#define ABF1SEQ1  0xBFC4FF78
#define ABF1SEQ0  0xBFC4FF7C
#define BF1DEVCFG3  0xBFC4FFC0
#define BF1DEVCFG2  0xBFC4FFC4
#define BF1DEVCFG1  0xBFC4FFC8
#define BF1DEVCFG0  0xBFC4FFCC
#define BF1DEVCP3  0xBFC4FFD0
#define BF1DEVCP2  0xBFC4FFD4
#define BF1DEVCP1  0xBFC4FFD8
#define BF1DEVCP0  0xBFC4FFDC
#define BF1DEVSIGN3  0xBFC4FFE0
#define BF1DEVSIGN2  0xBFC4FFE4
#define BF1DEVSIGN1  0xBFC4FFE8
#define BF1DEVSIGN0  0xBFC4FFEC
#define BF1SEQ3  0xBFC4FFF0
#define BF1SEQ2  0xBFC4FFF4
#define BF1SEQ1  0xBFC4FFF8
#define BF1SEQ0  0xBFC4FFFC
#define ABF2DEVCFG3  0xBFC6FF40
#define ABF2DEVCFG2  0xBFC6FF44
#define ABF2DEVCFG1  0xBFC6FF48
#define ABF2DEVCFG0  0xBFC6FF4C
#define ABF2DEVCP3  0xBFC6FF50
#define ABF2DEVCP2  0xBFC6FF54
#define ABF2DEVCP1  0xBFC6FF58
#define ABF2DEVCP0  0xBFC6FF5C
#define ABF2DEVSIGN3  0xBFC6FF60
#define ABF2DEVSIGN2  0xBFC6FF64
#define ABF2DEVSIGN1  0xBFC6FF68
#define ABF2DEVSIGN0  0xBFC6FF6C
#define ABF2SEQ3  0xBFC6FF70
#define ABF2SEQ2  0xBFC6FF74
#define ABF2SEQ1  0xBFC6FF78
#define ABF2SEQ0  0xBFC6FF7C
#define BF2DEVCFG3  0xBFC6FFC0
#define BF2DEVCFG2  0xBFC6FFC4
#define BF2DEVCFG1  0xBFC6FFC8
#define BF2DEVCFG0  0xBFC6FFCC
#define BF2DEVCP3  0xBFC6FFD0
#define BF2DEVCP2  0xBFC6FFD4
#define BF2DEVCP1  0xBFC6FFD8
#define BF2DEVCP0  0xBFC6FFDC
#define BF2DEVSIGN3  0xBFC6FFE0
#define BF2DEVSIGN2  0xBFC6FFE4
#define BF2DEVSIGN1  0xBFC6FFE8
#define BF2DEVSIGN0  0xBFC6FFEC
#define BF2SEQ3  0xBFC6FFF0
#define BF2SEQ2  0xBFC6FFF4
#define BF2SEQ1  0xBFC6FFF8
#define BF2SEQ0  0xBFC6FFFC

